{
  "events": [
    {
      "title": "Living in a Culture of the Past: The Life and Work of a Scribe in Hellenistic Uruk",
      "start_date": "2024-10-09T17:30:00",
      "end_date": "2024-10-09T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Abigail Hoskins\n\nThis lecture will take place in person at ISAW. Registration is required; click through for the registration link. \n\nThe figure of the scribe is essential to any discussion of ancient Mesopotamian culture. Decades of careful research have allowed historians to paint a general portrait of the Mesopotamian scribe that can then be placed into historical narratives. But what about the individuals from whom this composite picture was created?",
      "url": "https://isaw.nyu.edu/events/scribe-in-hellenistic-uruk",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/scribe-in-hellenistic-uruk/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Expanding the Ancient World Workshop:",
      "start_date": "2024-10-15T17:30:00",
      "end_date": "2024-10-15T19:30:00",
      "location": "Online",
      "description": "RSVP Required\n\nSpeaker: Erik Hermans\n\nGlobal Connections in the Late Antique and Early Medieval World\n\nThis workshop will take place online. Registration is required; click through for the registration link. Zoom information will be provided via confirmation email to registered participants. Expanding the Ancient World is a series of professional development workshops and online resources for teachers. During the second half of the first millennium CE, societies across the globe were connected with each other through conquest, trade, intellectual exchange, and climatological phenomena. While some of these connections have reached world history textbooks under the umbrella term 'silk road networks', the actual impact, nuances, and the limits of global connectivity in Afro-Eurasia and outside of it are hard to grasp and even harder to teach.",
      "url": "https://isaw.nyu.edu/events/etaw-global-connections",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/etaw-global-connections/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Early Globalization and Ancient Connectivity on the Eastern African Swahili Coast:",
      "start_date": "2024-10-16T17:30:00",
      "end_date": "2024-10-16T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Wolfgang Alders\n\nA View from Pangani Bay in Northern Tanzania\n\nThis lecture will take place in person at ISAW. Registration is required; click through for the registration link. How did hunters, pastoralists and small-scale farmers initiate the earliest forms of connectivity between coastal eastern Africa and the Indian Ocean world in the early-mid first millennium CE?",
      "url": "https://isaw.nyu.edu/events/early-globalization-eastern-african-swahili-coast",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/early-globalization-eastern-african-swahili-coast/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "ISAW Library Events: Imperial Waters: Unraveling the Impact of Nile Floods on Roman Egypt and the Empire",
      "start_date": "2024-10-21T17:30:00",
      "end_date": "2024-10-21T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Sabine Huebner\n\nThis lecture is the second in the ISAW Libraries events series for the 2024-2025 academic year. It will take place in person at ISAW. Registration is required; click through for the registration link. Sabine Huebner shares some of her recent work on the ancient environment, exploring how the Nile's floods shaped Egypt’s agriculture, society, and political stability, highlighting the incredible adaptability of the Egyptian people to environmental changes over centuries. She will reveal how a blend of climate change, particularly in the Nile flooding, and political choices shaped agricultural output, tax policies, and overall economy of Egypt under Roman rule.",
      "url": "https://isaw.nyu.edu/events/isawlib-huebner-nilefloods",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/isawlib-huebner-nilefloods/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Expanding the Ancient World Workshop",
      "start_date": "2024-10-23T17:30:00",
      "end_date": "2024-10-23T19:30:00",
      "location": "Online",
      "description": "RSVP Required\n\nSpeaker: Sydney A. Pickens\n\nTeaching Ancient Nubia: Integrating Kush in the Classroom\n\nThis workshop will take place online. Registration is required; click through for the registration link. Zoom information will be provided via confirmation email to registered participants. Expanding the Ancient World is a series of professional development workshops and online resources for teachers. Ancient Nubia has a rich history that spans over 4,000 years. This ancient African civilization was home to the city-state of Kerma which lasted an astounding 1,000 years, the Napatan Kings who conquered and ruled Egypt as the 25th Dynasty, and the Warrior Queens of the Meroitic Period who repelled the Roman invasion of Meroe.",
      "url": "https://isaw.nyu.edu/events/etaw-teaching-ancient-nubia",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/etaw-teaching-ancient-nubia/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Open House for Prospective Students",
      "start_date": "2024-10-28T10:00:00",
      "end_date": "2024-10-28T12:00:00",
      "location": "Online",
      "description": "RSVP Required\n\nISAW's open house for prospective doctoral students will take place online. Registration is required; click through for the registration link. Zoom information will be provided via confirmation email to registered participants. The event will include an opportunity to meet the ISAW faculty; an information session about our academic program; a Q&A session with current students; and sessions on archaeology, digital humanities, exhibitions, and the library at ISAW.",
      "url": "https://isaw.nyu.edu/events/open-house-2024",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/open-house-2024/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "18th Annual Leon Levy Lecture",
      "start_date": "2024-11-06T17:30:00",
      "end_date": "2024-11-06T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Michael Dietler\n\nOn Celts, Celticness, and Celtology: Reconciling Ancient and Modern Identities\n\nThis lecture will take place in person at ISAW. Registration is required; click through for the registration link. The lecture examines what it means to be Celtic in the contemporary world, and how modern Celts relate to peoples of the ancient past who were also called Celts.",
      "url": "https://isaw.nyu.edu/events/18th-annual-leon-levy-lecture",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/18th-annual-leon-levy-lecture/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Expanding the Ancient World Workshop:",
      "start_date": "2024-11-13T17:30:00",
      "end_date": "2024-11-13T19:30:00",
      "location": "ISAW Gallery",
      "description": "RSVP Required\n\nSpeaker: Carl Walsh\n\nDiscovering Life in al-Andalus through \"Madinat al-Zahra: The Radiant Capital of Islamic Spain\"\n\nThis workshop will take place in person at ISAW. Registration is required; click through for the registration link. Expanding the Ancient World is a series of professional development workshops and online resources for teachers. Learn more about Islamic art and material culture during the early Medieval Period (711–1031 CE) through the ISAW exhibition \"Madinat al-Zahra: The Radiant Capital of Islamic Spain.\"",
      "url": "https://isaw.nyu.edu/events/etaw-radiant-capital-of-islamic-spain",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/etaw-radiant-capital-of-islamic-spain/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Cyprus and the Levant from the Late Bronze Age to the Early Iron Age",
      "start_date": "2024-11-25T17:30:00",
      "end_date": "2024-11-25T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Artemis Georgiou and Anna Georgiadou\n\nCommercial and Cultural Connectivity on the Longue Durée\n\nThis lecture will take place in person at ISAW. Registration is required; click through for the registration link. Cyprus, acknowledged as the island of copper already during ancient times, plays an integral part in discussions involving ancient Mediterranean connectivity.",
      "url": "https://isaw.nyu.edu/events/cyprus-and-levant-late-bronze-age-to-early-iron-age",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/cyprus-and-levant-late-bronze-age-to-early-iron-age/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "Expanding the Ancient World Workshop",
      "start_date": "2024-12-11T17:30:00",
      "end_date": "2024-12-11T19:30:00",
      "location": "Online",
      "description": "RSVP Required\n\nSpeaker: Priya Barchi\n\nNavigating Early Indian Ocean Trade: A Resource for World History Teachers\n\nThis workshop will take place online. Registration is required; click through for the registration link. Zoom information will be provided via confirmation email to registered participants. Expanding the Ancient World is a series of professional development workshops and online resources for teachers. This workshop offers a deep dive into the maritime trade networks of the Western Indian Ocean from the 1st to the 5th century CE. It will highlight how ancient societies and empires engaged in a complex web of maritime exchanges long before the modern era.",
      "url": "https://isaw.nyu.edu/events/etaw-indian-ocean-trade",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/etaw-indian-ocean-trade/leadImage_mini",
      "rsvp_required": true
    },
    {
      "title": "ISAW Library Events: Strike: Labor, Unions, and Resistance in the Roman Empire",
      "start_date": "2025-03-12T17:30:00",
      "end_date": "2025-03-12T19:30:00",
      "location": "ISAW Lecture Hall",
      "description": "RSVP Required\n\nSpeaker: Sarah Bond\n\nThis lecture is the third in the ISAW Libraries events series for the 2024-2025 academic year. It will take place in person at ISAW. Registration is required; click through for the registration link. Sarah Bond will share some of her research from her recently published book Strike: Labor, Unions, and Resistance in the Roman Empire (Yale University Press), exploring how Roman workers used strikes, boycotts, riots, and rebellion to get their voices—and their labor—acknowledged.",
      "url": "https://isaw.nyu.edu/events/isawlib-bond-strike",
      "source": "ISAW",
      "university": "NYU",
      "department": "Institute for the Study of the Ancient World",
      "image_url": "https://isaw.nyu.edu/events/isawlib-bond-strike/leadImage_mini",
      "rsvp_required": true
    }
  ]
}