{
  "events": [
    {
      "title": "Narwhal Discover: Fall 2024",
      "description": "Transitioning into college is an exciting time! It can also feel like diving into uncharted waters, which is why we are here to guide you every step of the way. Our comprehensive tips and personalized programs are tailored specifically for students like you, ready to embark on this transformative experience?Let us be your trusted companions as you discover new opportunities, embrace personal growth, and create unforgettable memories during your New School journey. Get ready to make waves, chart your course, and unlock the extraordinary possibilities that lie ahead with Narwhal Discover by your side. ",
      "location": "Various Locations ",
      "url": "https://event.newschool.edu/NarwhalDiscoverFall2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "students",
        "student leadership and involvement",
        "university",
        "exhibitions and openings",
        "various locations "
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-08-28T04:00:00+00:00",
      "end_date": "2024-10-06T14:00:00+00:00"
    },
    {
      "title": "The Stone at The New School: September Calendar",
      "description": "The Stone at The New School serves as an artist-centric home and community for experimental and avant-garde artists, where they can perform what they want without any interference. With concerts every Wednesday through Saturday evening, The Stone at The New School continues the tradition of the landmark non-profit performance space founded in 2005 by Artistic Director John Zorn, within a greatly improved space.September 2024 will feature residencies by Trey Spruance, Craig Taborn, Sara Serpa, and Peter Evans.",
      "location": "The Glassbox Theater",
      "url": "https://event.newschool.edu/thestone09241",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "stone_event",
        "general public",
        "jazz",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performances",
        "the glassbox theater",
        "music performances",
        "theater performances"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-02T00:30:00+00:00",
      "end_date": "2024-10-01T02:00:00+00:00"
    },
    {
      "title": "CLIMATE WEEK HUB 2024",
      "description": "The generational threats to our well-being caused by ecological disruptions and climate change fuel the climate crisis and its impacts in overburdened, frontline communities. As long as injustices persist, there will be a resolute fight for a livable future. How our society chooses to respond to these impacts and remake itself toward a livable future determines how we authentically live up to our social justice and racial equity ideals. There is no future without Climate and Environmental Justice. Frontline movement leaders have been showing up and leading us for decades as champions of democracy, working to ensure that communities most affected by environmental issues have the power to create their desired solutions. Their work is essential in addressing systemic inequalities and empowering communities to take action. This year’s Climate Week in New York City marks the 10-year anniversary of the 400,000-strong Peoples’ Climate March, which was “a shift in the national U.S. climate movement, in centering the leadership of  Indigenous communities, communities of color, and working-class white communities who are both at the Frontlines of the Crises and the Forefront of Change.”This September, we invite you to join us for Climate Week events on campus and around the City.   Let’s come together as a community and collectively envision a better climate future, one where justice is at the core.  Our keynote event will feature two prominent speakers, Dr. Ayana Elizabeth Johnson and Stacey Abrams, who will lead a conversation on what we can do in the United States to reimagine a “Better world ahead.”Stay Tuned to this Climate Week Hub for upcoming events, and feel free to share widely. If you have any questions, please reach out to us at tedc@newschool.edu. ",
      "location": "Various Locations ",
      "url": "https://event.newschool.edu/climateweekhub2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "climate justice",
        "climate week",
        "environmental justice",
        "lobbymonitor",
        "researchworkpage",
        "sustainability",
        "eisjweb",
        "online_events_cal",
        "slide_events",
        "nd24pp",
        "general public",
        "cities and urbanism",
        "environment, sustainability, and climate change",
        "humanity, society, social justice",
        "media, science, and technology",
        "politics, policy and government",
        "university",
        "festivals and fairs",
        "various locations "
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-09T23:00:00+00:00",
      "end_date": "2024-10-01T02:00:00+00:00"
    },
    {
      "title": "ONLINE | New Employee Orientation",
      "description": "We're glad you're here! The Organizational Development team hosts virtual new employee orientation every two weeks. New employees will receive an email invitation directly to their New School email within their first week of joining The New School.Questions? Contact Ali Cherasia at chera187@newschool.edu. Looking for additional resources? Review our Welcome Guide and our Human Resources page to find important information as well as upcoming development opportunities and events. Note: This event is open to New School faculty and staff.",
      "location": "Virtual",
      "url": "https://event.newschool.edu/onlinenewemployeeorientation",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "hrevent",
        "faculty",
        "staff",
        "human resources",
        "university",
        "workshops and training",
        "virtual",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-10T14:00:00+00:00",
      "end_date": "2024-10-25T14:00:00+00:00"
    },
    {
      "title": "An Excess of Images: NYC on Film from the 1950s to the 1980s",
      "description": "We are awash with images of NYC, images that shape our understanding of what it is to be a New Yorker. In this film screening and discussion series, we will process this flood of images by attending to a particularly influential period of their production: the 1950s to 1980s. This period saw the return of location filming to the city and the reconceptualization of dirt as grit. Over the course of the fall, we will watch and discuss six films that exemplify six different ways in which these images have transformed our understanding of New York City.  ***All screenings are on Fridays at 7pm***- September 13 - Voyeur NYC: Rear Window (dir. Alfred Hitchcock, 1954)- September 27 - Ambitious NYC: Sweet Smell of Success (dir. Alexander Mackendrick, 1957)- October 11 - Lonely NYC: The Apartment (dir. Billy Wilder, 1960)- November 1  - Gritty NYC: The French Connection (dir. William Friedkin, 1971)- November 15 - Bohemian NYC: Girlfriends (dir. Claudia Weill, 1978)- December 6 - Simmering NYC: Do the Right Thing (dir. Spike Lee, 1989)",
      "location": false,
      "url": "https://event.newschool.edu/nyconfilm",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "students",
        "eugene lang college of liberal arts",
        "screenings",
        "film and media screenings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-13T23:00:00+00:00",
      "end_date": "2024-12-06T23:00:00+00:00"
    },
    {
      "title": "Latiné Heritage Month 2024",
      "description": "The New School celebrates Latiné Heritage Month. Join us for events throughout the month celebrating the rich and diverse histories, cultures, and contributions of the community. ",
      "location": "",
      "url": "event.newschool.edu/latineheritagemonth2024",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "exhibitions and openings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-16T02:00:00+00:00",
      "end_date": "2024-10-16T05:00:00+00:00"
    },
    {
      "title": "HYBRID | Student Support and Advocacy Training (Fall 2024)",
      "description": "‌The Student Support and Advocacy (SSA) office provides support to students experiencing non-academic challenges, connecting them to on and off campus resources and helping them navigate offices and systems inside and outside The New School. This can include concerns related to mental and physical health, interpersonal issues, behavior, issues impacting academic progress, food, financial and housing concerns, and more. ‌SSA is launching a series of trainings and workshops starting this Fall 2024, open to The New School community, including students, staff and faculty, who would like to learn more about Student Support and Advocacy, what resources and support are available, how to identify when a student is struggling and needs support, and how to connect with our team. ‌‌The current trainings for the semester are as follows:‌- Wednesday, Sept. 18, 2:00-3:30 p.m. (Zoom)‌- Thursday, Oct. 17 (Tentatively 1:30-3:00 p.m., In Person)‌- Tuesday, Nov. 12, 12:00-1:30 p.m. (Zoom) We are also offering customized training sessions for groups of 5 or more people. Requests can be submitted through the same link above, and our team will reach out to communicate the next steps. ‌If you have any questions or concerns related to these workshops or would like any additional information about Student Support and Advocacy, please feel free to email us at studentsupport@newschool.edu.",
      "location": "The New School",
      "url": "https://event.newschool.edu/ssatraining2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "faculty",
        "staff",
        "students",
        "student success office",
        "education and pedagogy",
        "university",
        "workshops and training",
        "the new school",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-18T18:00:00+00:00",
      "end_date": "2024-11-12T18:30:00+00:00"
    },
    {
      "title": "Spirited - A Celebration of Textiles in the Windows",
      "description": "Parsons MFA Textiles is celebrating New York Textile Month (NYTM) 2024 with Spirited - a showcase of textiles created by our Gen 6 students during their first year in the program. Visit the window displays at 5th Avenue on 13th Street (2W 13th Street, NY, NY-10001) to experience textiles that will enliven your spirit and join in our celebration of textiles. Featuring the textiles created by MFA Textiles Gen 6 students: Hattie Batstone, Jimena Bedoya, Wenyi (Crystal) Chen, Ziqi (Eva) Chen, Rachel Dana, Camille, Li, Luisa Mantelli, Yichen Pan, Jing Pei, Bhoomika Prasad, Jingyi Yang, and Moie Yang.Dates: September 19, 2024 - January 15, 2025RSVP Not Required",
      "location": "2 W 13th St",
      "url": "https://event.newschool.edu/spiritedacelebrationoftextiles",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "general public",
        "fashion",
        "parsons school of design",
        "exhibitions and openings",
        "2 w 13th st"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-19T16:00:00+00:00",
      "end_date": "2025-01-16T03:00:00+00:00"
    },
    {
      "title": "Economics Seminar Series",
      "description": "Hosted by The New School for Social Research's Economics Department, the seminar series features lectures, paper and book presentations from prominent economists.To register to our events, click on the event you want to attend to go to your event's page and click on the register button.",
      "location": false,
      "url": "https://event.newschool.edu/economicsseminarsonline",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Economics"
      ],
      "tags": [
        "online_events_cal",
        "general public",
        "department of economics",
        "education and pedagogy",
        "humanity",
        " society",
        " social justice",
        "international and global affairs",
        "intellectual culture and big ideas",
        "politics",
        " policy and government",
        "the new school for social research",
        "lectures and talks",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-24T20:00:00+00:00",
      "end_date": "2025-05-13T22:00:00+00:00"
    },
    {
      "title": "TIAA Financial Consultations",
      "description": "No matter what stage of life you’re in, meeting with a TIAA financial consultant can provide clarity and a better understanding of where you are and what you need to do to achieve your goals. TIAA financial consultants are available to answer your retirement plan questions and provide guidance on investment allocations, monthly contributions, and more. Consultants will work with you to understand your personal situation and goals, and provide guidance tailored to your needs. View TIAA's on-campus schedule below and register for your one-on-one session at www.tiaa.org/schedulenow or by calling 800-732-8353, weekdays, 8 a.m. to 8 p.m. (ET). Virtual sessions are also available.Please note: these sessions are available to all benefits eligible faculty and staff.",
      "location": "Alvin Johnson/J.M. Kaplan Hall",
      "url": "https://event.newschool.edu/tiaa_consultations",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "hrevent",
        "faculty",
        "staff",
        "human resources",
        "university",
        "workshops and training",
        "alvin johnson/j.m. kaplan hall",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-25T13:00:00+00:00",
      "end_date": "2024-10-25T21:00:00+00:00"
    },
    {
      "title": "Intractability. The Israeli – Palestinian Conflict In Focus Series",
      "description": "The current Israeli-Palestinian conflict has provoked many emotions (rage, guilt, victimization, condemnation), and a sense of hopelessness for its resolution. It is important to understand that the tragic events of the past year have occurred in the context of an intractable conflict. Intractable conflicts are characterized by master narratives that explain and justify the conflict for both sides. They support the necessity of the conflict as a zero-sum game. They also demonize the enemy and provide the set of arguments that is often associated with religious and moral superiority.This series is faculty-led and will explore the current Israel/Palestine conflict through the dynamics of intractability which includes psychological, historical and political components. We will hear the voices of both Israelis and Palestinian experts on the conflict, psychologists who study the relational effects of these master narratives, and hear from activists, local and international ones, who propose alternatives in this dismal landscape. These events are also organized to fulfill the mission of a University meant to prepare students through education, knowledge, and dialogue.  The seminars is collated by faculty members Warren Spielberg (NSPE) and Benoit Challand (NSSR). Please note the Community Agreements for this event.",
      "location": "HYBRID",
      "url": "https://event.newschool.edu/intractabilitytheisraelipales",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "online_events_cal",
        "slide_events",
        "lobbymonitor",
        "general public",
        "bachelors program for adults and transfer students",
        "psychology",
        "humanity, society, social justice",
        "politics, policy and government",
        "schools of public engagement",
        "lectures and talks",
        "hybrid",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-25T16:00:00+00:00",
      "end_date": "2024-11-01T18:00:00+00:00"
    },
    {
      "title": "ONLINE | Exploring Global Public Health: Concepts and Challenges",
      "description": "In an increasingly interconnected world, global public health stands out as a critical subject in our collective well-being. Most recently, the COVID-19 pandemic served as a monumental test for humanity, pushing the boundaries of state and global healthcare systems, revealing key issues, and leaving behind valuable lessons for the public health community. This free 10-week online seminar offers an in-depth exploration of the multifaceted realm of global public health, covering essential concepts, historical trends, governance frameworks, and contemporary challenges. Led by professionals in the field, participants will delve into the intricate challenges of addressing health disparities, pandemics, and environmental issues on a global scale.",
      "location": "Online | Zoom",
      "url": "https://event.newschool.edu/exploringglobalpublichealth",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "online_events_cal",
        "general public",
        "education and pedagogy",
        "humanity, society, social justice",
        "media, science, and technology",
        "politics, policy and government",
        "the new school for social research",
        "lectures and talks",
        "online | zoom",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-30T13:00:00+00:00",
      "end_date": "2024-09-30T14:30:00+00:00"
    },
    {
      "title": "ONLINE | Women, Peace, and Security in the Afghan Context",
      "description": "This seminar will delve into the multifaceted role of women in Afghanistan's peace and security landscape. By examining their historical struggle for rights and emancipation, their participation in formal and informal peace processes, and the impact of conflict on their unity and participation, we seek to shed light on the challenges and opportunities for women in building a more peaceful and democratic Afghanistan. Learning objectives include:1. Explore the historical journey of women's rights emancipation in Afghanistan2. Examine the role of women in traditional institutions and local dispute resolution mechanisms.3. Analyze women's participation in formal peace processes and its implications for democratic development.4. Identify hurdles hindering women;s participation in future peace processes and strategies to overcome them.5. Assess the impact of conflict on women's unity and participation in peacebuilding efforts6. Evaluate the \"youtification of governance\" strategy of the Ghani government and its investment in young Afghan women and men.",
      "location": "Online | Zoom",
      "url": "https://event.newschool.edu/womenpeaceandsecurity",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "online_events_cal",
        "faculty",
        "general public",
        "humanity, society, social justice",
        "international and global affairs",
        "politics, policy and government",
        "the new school for social research",
        "lectures and talks",
        "online | zoom",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-30T15:00:00+00:00",
      "end_date": "2024-09-30T16:30:00+00:00"
    },
    {
      "title": "Regeneration of Flax: Linseed, Linen, Shive, & Oil",
      "description": "Healthy Materials Lab presents Regeneration of Flax: Linseed, Linen, Shive, & Oil at the Arnold and Sheila Aronson Galleries on 5th Avenue in NYC. The exhibition will display the breadth of applications of products from the flax plant and encourage increased regional development of flax fiber in North America. Through the diversity of innovative designs, historic and current, our goal is to reconnect designers with the lifecycle of their materials.Exhibitors include: DumoLab Research at the University of Pennsylvania, Michelle Wilson, Danielle Burke, CQ Studio & more!Currently, fiber flax is primarily grown in Western Europe. Our exhibition will bring discourse to revitalization efforts of flax for linen textile production in North America. Additionally, the exhibition will highlight and display the use of linseed oil and shive byproducts for the built environment.Opening Panel and Reception: October 7 at 5pmExhibition: September 30 - November 12",
      "location": "Aronson Gallery",
      "url": "event.newschool.edu/regenerationofflax",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "exhibitions and openings",
        "aronson gallery"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-30T16:00:00+00:00",
      "end_date": "2024-11-12T23:00:00+00:00"
    },
    {
      "title": "Mannes Orchestra 2024-2025 Season Opener",
      "description": "Join us for the Mannes Orchestra season opener, featuring Yuchen Lu, winner of the 2024 George and Elizabeth Gregory Concerto Competition, performing Hindemith’s Der Schwanendreher and the WORLD PREMIERE of Jihwan Yoon’s In the Mirror... for Orchestra, winner of the Martinů Prize, which is given to a student or students demonstrating a unique voice and originality in musical composition for orchestra. The award is given in honor of the distinguished composer and former Mannes faculty member Bohuslav Martinů. The Berlioz Symphonie Fantastique rounds out this exciting evening.Please join us to usher in the 2024/2025 season with music both new and renowned!",
      "location": "Tishman Auditorium, The New School",
      "url": "https://event.newschool.edu/mannesorchestra20242025seasono",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "general public",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "tishman auditorium, the new school"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-09-30T23:30:00+00:00",
      "end_date": "2024-10-01T03:59:59+00:00"
    },
    {
      "title": "Manager Training",
      "description": " As part of our ongoing commitment to supporting professional growth and leadership development for all university staff, the Organizational Development team is excited to announce an enhanced virtual and in person Manager Training and Workshop series.Take your leadership skills to the next level with practical insights and actionable strategies in our new monthly Management Essentials training. In addition to these regular training sessions, we’ve curated a series of engaging and interactive workshops led by internal and external experts in leadership development, performance management, and mental well being. This new series is open to all staff members at the university. Management Essentials: Part I & IIOur internal management training is now offered in two parts and is available for all staff members to register and attend anytime throughout the spring semester. Both sessions will be offered once a month from October through June, 2025. Manager Essentials Part I: The Essentials: This essential training for both new and experienced managers will refresh your toolkit, encourage understanding of critical university procedures, and help you ensure that your team feels welcomed, connected, and set up for success. Join us as we discuss onboarding plans and management best practices, including managing performance. Manager Essentials Part II: Putting Theory into Practice: Join this workshop-style training session to continue the learning from Manager Essentials Part I. Immerse yourself with a group of peers in realistic management scenarios in which you’ll learn through applying best practice management principles and tools.Please note: our two Manager Essentials training sessions will be offered on a monthly basis. Staff members should attend one Part I training session before they register for their Part 2 training session.",
      "location": "   ",
      "url": "https://event.newschool.edu/hrmanagertraining",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "hrevent",
        "staff",
        "human resources",
        "workshops and training",
        "   ",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-01T14:00:00+00:00",
      "end_date": "2024-11-19T16:00:00+00:00"
    },
    {
      "title": "Lang Craft Talks featuring Clement Goldberg",
      "description": "The Lang Craft Talks series continues with Clement Goldberg, an award-winning Multidisciplinary Artist, Writer, Director and Animator.Clement Goldberg who is non-binary trans and queer, works across disciplines to create satirical yet hopeful projects that center collective grief rooted in climate crisis, cultural erasure and extinction. Clement’s debut novel New Mistakes is forthcoming from DOPAMINE Press / Semiotext(e) September 2024. Their feature film project Let Me Let You Go received a 2022 Creative Capital Award.Their work has been presented at REDCAT Theatre, The BROAD Museum, VORTEX Rep, BAMPFA, Institute of Contemporary Art Philadelphia, and over 50 international film and arts festivals including Frameline, Outfest, MIX NYC, Hamburg International Queer Film Festival and Cleveland International Film Festival.  Clement received an MFA in Art Practice and a Graduate Certificate in New Media Studies from the University of California, Berkeley. Lang hosts a series of weekly dynamic and interactive lessons in the craft of writing. Each week features a different writer including Lang faculty, alumni and special guest writers.  Visit the Lang Craft Talks Hub for the full line-up of writers this spring!",
      "location": "Virtual",
      "url": "https://event.newschool.edu/clementgoldberg",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "eugene lang college of liberal arts",
        "lectures and talks",
        "virtual",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-01T16:30:00+00:00",
      "end_date": "2024-10-01T17:30:00+00:00"
    },
    {
      "title": "Fashion, Policy & Regeneration",
      "description": "Join us for Fashion, Policy & Regeneration and be part of the movement redefining fashion’s future. Dive into impact-driven policy work that’s pushing beyond sustainability to embrace regeneration. Michael Sheldrick, Co-Founder of Global Citizen and author of “From Ideas to Impact,” will explore how regenerative fabrics, ethical practices, and bold incentives for young brands can transform the industry with our panelists.Michael Sheldrick: Michael Sheldrick is a policy entrepreneur, author and Co-Founder at Global Citizen. Over the past decade, Michael has led Global Citizen’s campaigns to distribute over $40 billion to anti-poverty and climate resiliency efforts around the world. Michael has worked with an impressive roster of cultural icons such as Idris and Sabrina Elba, Beyoncé, Michelle Yeoh, as well as impact and policy leaders such as Jane Goodall, Kevin Rudd, Mia Mottley, and Ban Ki-Moon. Michelle Gabriel:Michelle is a PhD candidate in political economy and social policy at the Yunus Centre for Social Business and Health at Glasgow Caledonian University in Glasgow, Scotland. She currently serves as the Program Director for M.S. in Sustainable Fashion at IENYC, where she brings her research and experience in policy, political engagement, social enterprise strategy, design, branding, product development, supply chain, and production for fashion and consumer product brands.Dustin White:Dustin White is an accomplished entrepreneur with a history of driving innovation across multiple industries. While studying for his MBA at Pepperdine University, Dustin launched a camera leasing and rental business that became one of the fastest-growing companies in the U.S. His success earned him multiple appearances on INC’s Fastest Growing Companies list, and his company was named both the fastest-growing company and the 5th best place to work in Los Angeles by the LA Business Journal.In his pursuit of sustainable fabric solutions, Dustin formed a partnership with a Swiss-based R&D company specializing in bio-based chemistry for textiles. This collaboration led to the creation of LAB Denim, a company that is set to revolutionize the denim industry through its patented indigo-free denim fabric that eliminates almost 100% of the water used in traditionaldenim production, along with the chemicals and processes typically required to age denim. LAB Denim is working with top brands in the denim industry to change the way denim is created.Kelly Cutrone:Kelly Cutrone is the CEO and Founder of People’s Revolution.She is a 2x New York Times and National Best Selling Author. Cutrone has appeared consecutively for a decade on The Hills, The City, Kell On Earth, The Kelly Cutrone Project, Dr. Phil and America’s Next Top Model.Runa Ray:Runa Ray is a Met Gala designer and Fashion Environmentalist who uses fashion to educate and advocate for policy change. Having worked extensively with sustainable development goals at the United Nations, her designs encompass nature based solutions. She is the founder of Kelptex which harvests invasive algae and creates non woven fabric, and Fashioning for Social Environmental Justice a non profit that connects humanity to its environment ",
      "location": "Kellen Auditorium",
      "url": "https://event.newschool.edu/fpr",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "general public",
        "arts",
        "design",
        "parsons school of design",
        "lectures and talks",
        "kellen auditorium",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-01T22:30:00+00:00",
      "end_date": "2024-10-01T23:30:00+00:00"
    },
    {
      "title": "Belonging Journey Dialogue Series: Bridge to Belonging",
      "description": "The Belonging Journey is a dialogue series focused on exploring structural inequalities, understanding power and privilege, and bolstering a sense of belonging as part of the remedy. It explores self-determination and agency as critical components to understanding one's self, navigating challenges, and utilizing your power to effect change.These events are open only to New School students.This event is part of The Belonging Journey Initiative.",
      "location": "University Center, The New School",
      "url": "https://event.newschool.edu/belongingjourney1",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "students",
        "office of equity, inclusion, and social justice",
        "humanity, society, social justice",
        "university",
        "workshops and training",
        "university center, the new school",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-02T17:30:00+00:00",
      "end_date": "2024-10-02T18:45:00+00:00"
    },
    {
      "title": "ONLINE | Debating Chinese Politics (激辩中国政治)",
      "description": "Course will be conducted in Chinese. Chinese description follows English description below.This free 10-week online seminar offers a series of timely debates conducted in Chinese and aimed at a global Chinese audience, focusing on important and controversial issues in Chinese politics and international relations that cannot be freely discussed inside China. In each 90-minute session, guest debaters who are authorities in the subject area will be randomly assigned to present pro and con positions on the following propositions; the audience will vote on each proposition before the debate and at the end of the debate, and will also have a chance to pose questions. We hope to help Chinese in China and around the world think through their own positions on a variety of issues facing China at home and abroad.Debate topics include: 1. Democracy is suitable for China2. The China Model works well; it should be emulated by other countries3. The majority of Chinese people support the Chinese Communist Party4. China’s long-term strategic goal is to overthrow the rule-based international order5. The West’s engagement policy toward China was a failure6. The way modern technology is developing helps drive the trend toward authoritarianism7. It is not enough for the U.S. to manage competition with China, it needs to promote regime change8. Activists can effectively promote China’s democratization through non-violent means9. Chinese people should support “the great unification”  10. Trump presidency will be in favor of China’s democratization 中国的民主转型受到阻碍，但很多人仍在为推进中国的宪政民主而努力。中国在国际舞台上扮演着越来越重要的角色，“中国向何处去”越来越成为举世关切的问题。然而，在与中国相关的政治、经济、公民社会、民族和国际关系等一些重大问题上，无论是在理论上还是在实践中，政策制定者、知识分子和普通民众之间都存在着巨大的分歧。美国和其他民主国家已经重新考虑了对中国的接触政策，对华政策在发生深刻转变，但对中国政治和社会的天真看法和误解仍然存在。 在此背景下，新学院大学（the New School）的The New University In Exile Consortium将开设网课《激辩中国》，由哥伦比亚大学教授黎安友和纽约城市大学亨特学院客座教授、《中国民主季刊》副主编滕彪主持。本网络课程免费向所有人开放注册。完成80%课程者，将获得新学院大学颁发的结课证书。本讲座将就中国政治中重要而有争议的问题，邀请相关领域的学者专家展开一系列辩论。 1 、民主制度适合中国 VS 民主制度不适合中国2、中国模式是成功的模式 VS 中国模式是失败的模式3、多数中国民众仍支持中国政府 VS多数中国民众不支持中国政府4、中国对现有国际秩序构成威胁  VS 中国对现有国际秩序不构成威胁5、西方对华的接触政策已经失败 VS 西方对华的接触政策没有失败6、高科技有利于专制政权 VS 高科技有利于公民社会7、美国应推动中国政权更迭 VS 美国应推动中国政权更迭8、在中国民主化进程中应该采取非暴力抵抗 VS 中国民主化进程中不应排除暴力反抗  9、中国应该 \"大一统\" VS 西藏、新疆应有自决权  10、川普成为美国总统有利于中国民主化 VS 川普成为美国总统不利于中国民主化",
      "location": "Online | Zoom",
      "url": "https://event.newschool.edu/debatingchinesepolitics",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "online_events_cal",
        "general public",
        "humanity, society, social justice",
        "international and global affairs",
        "politics, policy and government",
        "the new school for social research",
        "lectures and talks",
        "online | zoom",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-03T14:00:00+00:00",
      "end_date": "2024-10-03T15:30:00+00:00"
    },
    {
      "title": "ONLINE | De-Escalation Training with DC Peace Group",
      "description": "The Provost's Office continues to source opportunities to build our community's capacity to engage in meaningful dialogue, support peaceful protest, and de-escalate situations in the classroom and on campus. Skill-building and human connection are critical to creating a community of care.This virtual training offered by the DC Peace Team focuses on nonviolent, safe alternative approaches for defusing harmful situations. The session will be solely for New School faculty and staff and includes skill building, role-play and deeper discussion.  This workshop is designed for New School faculty and staff. If you are a student interested in attending a training, please reach out to provost@newschool.edu. ",
      "location": "Virtual",
      "url": "event.newschool.edu/virtualdeescalationtrainingwitcopy",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "workshops and training",
        "virtual",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-03T18:00:00+00:00",
      "end_date": "2024-10-03T21:00:00+00:00"
    },
    {
      "title": "SCE Public Programs: Architecture",
      "description": " Please join us at Parsons School of Constructed Environments highlighting the Architecture programs. Our guest speakers will be Bobby Johnston and Ruth Mandl of CO Adaptive. They founded CO Adaptive in  2011. \"Within an industry highly predicated on the finished image of architecture, we seek to turn focus to the means of making and maintaining it. We believe that design and building is a process rather than an end result; it should be a collaborative practice that works to solve today’s biggest challenges—and does this by building upon the past rather than reinventing it.\"Drinks will be served afterwards.  ",
      "location": "Glass Corner E206",
      "url": "https://event.newschool.edu/scepublicprogramsarchitecture2",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design",
        "Constructed Environments"
      ],
      "tags": [
        "batec10",
        "online_events_cal",
        "slide_events",
        "alumni",
        "faculty",
        "general public",
        "prospective students",
        "staff",
        "students",
        "school of constructed environments",
        "faculty/student/alumni/staff research & work",
        "design",
        "cities and urbanism",
        "parsons school of design",
        "lectures and talks",
        "glass corner e206",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-03T21:00:00+00:00",
      "end_date": "2024-10-03T22:30:00+00:00"
    },
    {
      "title": "Mannes Wind Symphony performs Adams, Copland, Piazzolla and Rodrigo",
      "description": "Anchored around John Adams' challenging and seldom performed \"Grand Pianola Music\", this exciting program features works by some of our greatest composers of Latin and American music.With the support of a full wind ensemble throughout, this program dances between varied Spanish, American, and Latin American styles all originating from the last century. The Spanish/Latin compositions by Rodrigo and Piazzolla center around traditional clave rhythms. Copland's \"Quiet City\" works with rhythmic freedom and lush, open chords that support the solo voices of trumpet and english horn. This \"American\" sound is also evident in the use of Adams' harmonic language, coupled with a minimalistic, yet complex, rhythmic drive. The addition of two harmonious pianos and 3 voices give new range to the sound of a wind ensemble, making \"Grand Pianola Music\" a unique, masterful composition like no other. Program-Adagio Para Orquesta de Instrumentos de Viento - Joaquín RodrigoQuiet City - Aaron CoplandTanguango - Astor Piazzolla (arr. Colin McClure)-Intermission-Grand Pianola Music - John Adams Conducted by Brandon RidenourFree with registration.",
      "location": "John L. Tishman Auditorium",
      "url": "https://event.newschool.edu/manneswindsymphonyworksbyadams",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "general public",
        "jazz",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "john l. tishman auditorium"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-03T23:30:00+00:00",
      "end_date": "2024-10-04T01:00:00+00:00"
    },
    {
      "title": "ONLINE | Social Media Data Training",
      "description": "This training is for managers, comms directors, or student workers who directly manage social media channels on behalf of the university and use platform data. We will cover how to access, interpret, and leverage the data from your social media accounts.Please note: This training does not cover how to use Sprout, but the information on data interpretation will still be applicable for all account managers.This session will be recorded and shared afterwards. ",
      "location": "Virtual",
      "url": "https://event.newschool.edu/socialmediadatatraining",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "staff",
        "marketing and communication",
        "university",
        "workshops and training",
        "virtual",
        "continuing education"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-04T14:00:00+00:00",
      "end_date": "2024-10-04T15:00:00+00:00"
    },
    {
      "title": "GIDEST Seminar with Colin Stearns",
      "description": "Please join us for a conversation with Colin Stearns, Associate Professor of Photography at Parsons School of Design and 2024-25 GIDEST Faculty Fellow. A photographer dedicated to the form of the photobook, Colin will be presenting work from “The Line,” his ongoing project of walking, researching, and photographing the Mason-Dixon Line. “The Line” oscillates between exploring the deep historical significance of the Mason-Dixon Line, understanding the current realities of living near this mythic border of freedom, and reflecting on Colin's own identity as someone who identifies as a southerner. The research started in the early years of the Presidency of Barack Obama and has continued through the current Biden administration. Colin has authored photobooks published by RITA BOOKS (2015) and KGP+ (2017). In 2018, he began self-publishing his work to explore publishing as an art form. In 2021, he founded Nonlinear Books, an experimental publishing venture aimed at advancing the form, function, and language of the photobook. The primary focus of Nonlinear Books is addressing issues surrounding race, patriarchy, and disenfranchisement. A central tenet of this initiative is ensuring affordability for all, while also prioritizing support for underrepresented photobook makers.Colin's photobooks are included in collections at prominent institutions including The International Center of Photography Library, The New York Public Library, The New School Library, Ronald Feldman Gallery, Beinecke Rare Book and Manuscript Library at Yale University, The Sloane Art Library at the University of North Carolina, and the Hellenic Centre for Photography in Athens, Greece. This seminar is a discussion of a pre-circulated work. It can be found on the GIDEST site for attendees to read in advance. This event is part of the bi-weekly GIDEST Seminars presented by the Graduate Institute for Design, Ethnography & Social Thought.",
      "location": "The New School University Center, GIDEST Lab, Room 411",
      "url": "https://event.newschool.edu/gidestseminarwithcolinstearns",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Parsons School of Design"
      ],
      "tags": [
        "general public",
        "anthropology",
        "arts",
        "intellectual culture and big ideas",
        "parsons school of design",
        "the new school for social research",
        "lectures and talks",
        "the new school university center, gidest lab, room 411",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-04T16:00:00+00:00",
      "end_date": "2024-10-04T17:30:00+00:00"
    },
    {
      "title": "Authoritarian Planning: Extractivism and Crisis in Angola",
      "description": "The African Studies Initiative (ASI) presents: Authoritarian Planning: Extractivism and Crisis in Angola Jon Schubert argues that oil dependence and speculation are not planning failures but deliberate tools for regime control, creating distinct logics and aesthetics. His work on Angola reveals how urbanization and power dynamics shift during economic crises when infrastructure investments seem unrealistic. Speculative infrastructure drives urban development and economic diversification, masking the creation of an oil-dependent economy. As for Angolans, they monitor oil prices as if they were divine.Jon Schubert, Urban Studies, University of Basel This seminar is based on a pre-circulated paper to be read in advance. To receive a copy of the paper, please register.",
      "location": "Rm. H713 - 7th floor",
      "url": "https://event.newschool.edu/authoritarianplanning",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Graduate Program and International Affairs"
      ],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "online_events_cal",
        "general public",
        "julien j. studley graduate programs in international affairs",
        "international and global affairs",
        "lectures and talks",
        "rm. h713 - 7th floor",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-04T17:00:00+00:00",
      "end_date": "2024-10-04T18:30:00+00:00"
    },
    {
      "title": "Book Talk - Smith Mehta - The New Screen Ecology in India: Digital Transformation of Media",
      "description": "Please join us for a conversation about global creator cultures, media industries and social media entertainment, featuring a book talk with Smith Mehta - the author of The New Screen Ecology in India: Digital Transformation of Media - in conversation with Tejaswini Ganti and Rahul Mukherjee. ",
      "location": "The Auditorium",
      "url": "https://event.newschool.edu/booktalksmithmehta",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "sociology",
        "intellectual culture and big ideas",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "lectures and talks",
        "the auditorium",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-04T19:00:00+00:00",
      "end_date": "2024-10-04T21:00:00+00:00"
    },
    {
      "title": "Preconcert Talk - Violist Dana Kelley, moderator; Composer Leila Adu-Gilmore and members of the Verona Quartet",
      "description": "This FREE 1-hour-long pre-concert event is part of the Schneider Concerts' Fall Festival: Stories in Chamber Music. Violist Dana Kelley hosts a talk with the members of the Verona String Quartet and composer Leila Adu-Gilmore exploring the stories behind the works included in the Verona's performance later in the day.Ravel: String Quartet in F Major (1903)Wynton Marsalis: Creole Contradanzas from String Quartet No. 1 \"At the Octaroon Balls (1998)Leila Adu-Gilmore: String Quartet \"if the stars align\" (2016)Beethoven: String Quartet in E Minor, Op. 59, No. 2 (1808) The Verona Quartet's 2pm performance requires ticket purchase now, or at the door, following this free talk. This talk is part of the Schneider Concerts Fall Festival focusing on story in chamber music. Find out more about the entire 2024-25 season including six concerts, live streams, talks, artist meet greets, events in partner venues, and a book club. This event is accessible, as are all the Schneider Concerts 2024-2025 season events. If you have questions about access and any needed accommodations, please Call +1 212.229.5873 or contact nsc@newschool.edu",
      "location": "66 W 12th St",
      "url": "https://event.newschool.edu/preconcerttalkveronaquartet",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "general public",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "lectures and talks",
        "66 w 12th st",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-06T15:00:00+00:00",
      "end_date": "2024-10-07T03:59:59+00:00"
    },
    {
      "title": "Livestream | Verona String Quartet",
      "description": "On Sunday, October 6 at 2pm (ET) the Schneider Concerts presents the Verona Quartet. If you can't be there in person, register to receive a link to the livestream so you don't miss a note. We are committed to providing you access to high quality chamber music, so this is a \"pay-what-you-wish\" Schneider Concerts event. If the cost of purchasing a ticket would prevent you from attending this event, we invite you to select the free ticket option.If not, we invite you to purchase a ticket to this livestream at the same cost an in-person audience member would, or pick the price you think is right for a live stream experience.Verona Quartet Ravel: String Quartet in F Major (1903)Wynton Marsalis: Creole Contradanzas - Moment 3 from String Quartet No. 1 \"At the Octoroon Balls\" (1995)Leila Adu-Gilmore: String Quartet \"if the stars align\" (2012)Beethoven: String Quartet in E Minor, Op. 59, No. 2 (1808) Find out about the rest 2024-25 Schneider Concerts season of six concerts (live-streamed for those who can't attend in person), preconcert talks, artist meet greets, events in partner venues, and more.October 6, 2024 at 2pm Verona QuartetNovember 17, 2024 at 2pm Erinys QuartetDecember 8, 2024 at 2pm Kenari QuartetJanuary 12, 2025 at 2pm Ivalas QuartetMarch 9 2025 at 2pm Ivalas Quartet with Ayana Kozasa, viola and Anthony McGill,clarinetApril 6, 2025 at 2pm Trio Gaia joined by Ivalas Quartet",
      "location": "Virtual",
      "url": "https://event.newschool.edu/livestreamveronaquartet",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "general public",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "virtual"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-06T18:00:00+00:00",
      "end_date": "2024-10-06T20:00:00+00:00"
    },
    {
      "title": "Schneider Concerts Presents | Verona Quartet",
      "description": "Verona QuartetJonathan Ong, ViolinDorothy Ro, ViolinAbigail Rojansky, ViolaJonathan Dormand, CelloRavel: String Quartet in F Major (1903)Justinian Tamasuza: Africa String Quartet - Eiktunda Ekisuka (first movement) (1992)Leila Adu-Gilmore: String Quartet \"if the stars align\" (2016)Beethoven: String Quartet in E Minor, Op. 59, No. 2 (1808).This concert will be approximately one hour and 40 minutes, including intermission NOTE: There is an 11:00 a.m. pre-concert talk that is included at no extra charge for full season subscribers. Tickets to this event will be made available to single ticket buyers based on availability.",
      "location": "New School Auditorium - 66 W. 12th Street, NYC, NY",
      "url": "https://event.newschool.edu/schneiderconcerts-veronaquartet",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "american composers",
        "black composers",
        "chamber music",
        "classical music",
        "emerging artists",
        "new music",
        "string quartet",
        "ravel",
        "justinia tamuzusa",
        "african composers",
        "beethoven",
        "general public",
        "mannes school of music",
        "arts",
        "performing arts",
        "college of performing arts",
        "performances",
        "new school auditorium - 66 w. 12th street, nyc, ny",
        "music performances",
        "theater performances",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-06T18:00:00+00:00",
      "end_date": "2024-10-06T20:00:00+00:00"
    },
    {
      "title": "Schneider Concerts 2024-2025 Season",
      "description": "Schneider Concerts 2024-25 Season is chamber music concerts and much, much more.It's finding calm in the familiar, and stretching out of your comfort zone to discover new works, new ideas, and some astounding new artists as we join together in community to celebrate chamber music, the genre sometimes referred to as \"music among friends.\"A $90 subscriptions includes: offers 6 in-person concerts, pre-concert lectures, artist meet greets, and a book club (with a special Arnold Steinhardt zoom appearance). - All 6 concerts at The New School - October 6, 2024  11:00a.m. pre-concert talk - October 6 Fall Festival opening reception following concert - January 12 Spring Season opening reception following concert - Book club: In keeping with our fall \"story\" theme, we'll gather together to read Arnold Steinhardt's \"Indivisible by Four.\" Mr. Steinhardt will join us via Zoom at our final session to discuss the book and his time with the Guarneri Quartet. - Additional pre-concert talk (date TBA)You will have an opportunity to let us know which of this you wish to attend on the subscription purchase form.You can also come a la carte, join us at one of our community partner venues, or stay home and enjoy via live stream. NOTE: We will not be mailing physical tickets for this series. You will receive email confirmation and periodic reminders before each concert, and we will have guest list check-in with ticket-buyers' names at each performance.See details on dates, artists, and repertoire below.",
      "location": "New School Auditorium - 66 W. 12th Street, NYC, NY",
      "url": "https://event.newschool.edu/schneiderconcerts2024-2025season",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Jazz",
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "beethoven",
        "black composers",
        "chamber music",
        "classical music",
        "contemporary music",
        "debut",
        "haydn",
        "live performance",
        "music",
        "new music",
        "premiere",
        "string quartet",
        "women composers",
        "piano trio",
        "african composers",
        "general public",
        "mannes school of music",
        "school of jazz",
        "arts",
        "performing arts",
        "college of performing arts",
        "performances",
        "new school auditorium - 66 w. 12th street, nyc, ny",
        "music performances",
        "theater performances",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-06T23:00:00+00:00",
      "end_date": "2030-01-11T00:00:00+00:00"
    },
    {
      "title": "Regeneration of Flax: Panel",
      "description": "A farmer, a designer, a processor, and a sustainability expert join us to discuss the potential of flax.In a hybrid event, on October 7th, a panel of experts will take a deep dive into the lifecycle and material potential processing flax for fiber, oil and building materials. The panel is part of a series of public events coinciding  with our current exhibition, Regeneration of Flax: Linseed, Linen, Shive & Oil at the Arnold and Sheila Aronson Galleries, 66 Fifth Avenue at 13th Street, New York. With 60% of textile fibers made of synthetic polyester today, we look to the robust history of flax growing over the last 36,000 years, as a viable biobased alternative to synthetics.  Flax is grown as a rotational crop and sequesters carbon as it grows. Flax fibers create linen fabrics, composites and insulation. Flax seed can be a food, or pressed into oils for finishes and flooring. Shive, a woody byproduct, is used for mulch and being researched for flaxlime.  We will discuss the methods of farming organically and the potential of flax to remove heavy metals from soil. Experts will discuss the challenges of scaling, applications in the built environment  and the benefits of local material sourcing for regional economies.  What if designers were more connected with agriculture and the lifecycle of their materials? The panel will be held from 5-6:30pm.  The exhibition opening and reception 6:30-8pm. RSVP Today!",
      "location": "Anna-Maria and Stephen Kellen Auditorium, N101 | Parsons School of Design",
      "url": "https://event.newschool.edu/regenerationofflaxpanel",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "general public",
        "design",
        "environment, sustainability, and climate change",
        "parsons school of design",
        "lectures and talks",
        "anna-maria and stephen kellen auditorium, n101 | parsons school of design",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-07T21:00:00+00:00",
      "end_date": "2024-10-08T00:00:00+00:00"
    },
    {
      "title": "ONLINE | Immigration and the U.S. Presidential Election",
      "description": "The NSSR and Eugene Lang College Dean's Offices and the Zolberg Institute on Migration and Mobility invite you to join a conversation on immigration and the U.S. presidential election with Alexandra Délano Alonso, Professor of Politics and Global Studies, moderated by Alex Aleinikoff, NSSR Executive Dean and Director of the Zolberg Institute on Migration and Mobility.Please also join NSSR & Lang on Tuesday, October 29 at 4 PM for \"Intelligent Insights on Economic Issues in the 2024 Presidential Election\"",
      "location": "Online | Zoom",
      "url": "https://event.newschool.edu/immigrationelection",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "online_events_cal",
        "lobbymonitor",
        "general public",
        "international and global affairs",
        "politics, policy and government",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "lectures and talks",
        "online | zoom",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-07T22:00:00+00:00",
      "end_date": "2024-10-07T23:00:00+00:00"
    },
    {
      "title": "Lang Craft Talks featuring Emily Jon Tobias",
      "description": "The Lang Craft Talks series continues with Emily Jon Tobias, an American author and poet. She is an award-winning writer whose work has been nominated for the Pushcart Prize, along with other honorable mentions, and has been featured in literary journals such as Santa Clara Review, Talking River Review, Flying South Literary Journal, Furrow Literary Journal, The Opiate Magazine, The Ocotillo Review, Jerry Jazz Musician, Typehouse Literary Magazine, Tahoma Literary Review, Big Muddy, Spoon Knife, Peauxdunque Review, and elsewhere. Midwestern-raised, she now lives and writes on the coast of Southern California and holds a Master of Fine Arts in Writing from Pacific University Oregon. MONARCH: STORIES (Black Lawrence Press, 2024) is her debut collection, winner of the 2024 American Book Fest International Book Awards and finalist for the 2024 American Book Fest Fiction Awards for a short story collection.Lang hosts a series of weekly dynamic and interactive lessons in the craft of writing. Each week features a different writer including Lang faculty, alumni and special guest writers.  Visit the Lang Craft Talks Hub for the full line-up of writers this spring!",
      "location": "Virtual",
      "url": "https://event.newschool.edu/emilytobias",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "eugene lang college of liberal arts",
        "lectures and talks",
        "virtual",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-08T16:30:00+00:00",
      "end_date": "2024-10-08T17:30:00+00:00"
    },
    {
      "title": "LGBTQ+ History Month Kick-Off Mixer",
      "description": "Join us for the first annual LGBTQ History Month Mixer to kick off this History Month.  Light refreshments and appetizers will be served.  Open to The New School community, free event.  No registration is required.",
      "location": "University Center, The New School",
      "url": "https://event.newschool.edu/lgbtqhistorymonthmixer",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "faculty",
        "staff",
        "students",
        "student success office",
        "humanity, society, social justice",
        "university",
        "fairs & festivals",
        "university center, the new school"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-08T17:00:00+00:00",
      "end_date": "2024-10-08T19:00:00+00:00"
    },
    {
      "title": "Economics Seminar: Mark Setterfield",
      "description": "Mark Setterfield, Leo Model Professor of Economics at NSSR&lt; will present his latest paper, \"Integrating the Social Reproduction of Labor into Macroeconomic Theory.\"Abstract:The purpose of this paper is to contribute to the integration of unpaid care-giving in the household into short- and long-term macroeconomic theory and, in particular, the theoretical structure of production on the supply-side of the economy. The ambition of the project is to furnish a general theoretical representation of how unpaid care giving and its (gendered) social structure contributes to the technical conditions of production in the sphere of marketed output. In so doing, it aims to provide macro theorists with an apparatus that allows consistent description of both short-term (levels of activity) and long-term (rates of growth) macro outcomes in a manner that routinely integrates feminist insights regarding the gendered structure of the social reproduction of labor into macroeconomic analysis.Non-New School community members: Please register to get access to the buildings, as those that don't and are not on the RSVP list may be refused by security.",
      "location": "6 East 16th St., Room #1103",
      "url": "https://event.newschool.edu/marksetterfield",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "general public",
        "economics",
        "faculty/student/alumni/staff research & work",
        "humanity, society, social justice",
        "politics, policy and government",
        "the new school for social research",
        "lectures and talks",
        "6 east 16th st., room #1103",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-08T20:00:00+00:00",
      "end_date": "2024-10-08T22:00:00+00:00"
    },
    {
      "title": "Interdisciplinary Science Meet-Up and Open House",
      "description": "Join us to learn more about the departmental courses being offered in Spring 2025, the Interdisciplinary Science major and minor requirements, and how to apply for internships.We’ll also hear from some current students about their recent research projects.Refreshments will be provided!",
      "location": "6 EAST 16TH STREET, ROOM D1001",
      "url": "https://event.newschool.edu/isfall2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "students",
        "eugene lang college of liberal arts",
        "info session/open house",
        "6 east 16th street, room d1001",
        "admission info session/open house",
        "online or live streamed"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-08T21:30:00+00:00",
      "end_date": "2024-10-08T23:00:00+00:00"
    },
    {
      "title": "Direct Action: Ben Russell and Guillaume Cailleau in Conversation",
      "description": "Direct action is a tactical strategy of protest that seeks to achieve an end directly and by the most effective means. DIRECT ACTION is a contemporary portrait of one of the most high-profile militant activist communities in France: a 150-person strong rural collective that successfully resisted an international airport expansion project in 2018, created an autonomous zone between 2012 and 2018, survived multiple violent eviction attempts by the French state and spawned a new ecological movement in 2021. Using a collaborative and immersive observational approach, the film documents the everyday lives of a diverse ecosystem of activists, squatters, anarchists, farmers and those labelled by the government as “eco-terrorists”. Can the success of a radical protest movement offer a path through the climate crisis? Filmmakers Ben Russell and Guillaume Cailleau will discuss their new film. Note: this event is a discussion only, not a screening. Those interested in watching the film can book tickets through the New York Film Festival website.",
      "location": "6 EAST 16TH STREET, ROOM 538",
      "url": "event.newschool.edu/directaction",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "lobbymonitor",
        "online_events-cal",
        "lectures and talks",
        "6 east 16th street, room 538",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T16:00:00+00:00",
      "end_date": "2024-10-09T17:30:00+00:00"
    },
    {
      "title": "The Fashion Act Summit: NYS Textile Legislation Conference",
      "description": "Join Parsons School of Fashion and the Manhattan Solid Waste Advisory Board (MSWAB) for talks by New York State Assemblywoman Dr. Anna Kelles and Senator Brian Kavanaugh about their forthcoming bills in the NYS legislature, including the Fashion Act and Extended Producer Responsibility (EPR) for Textiles. Keynotes will cover how these bills seek to address issues around climate, waste and the environment, and labor rights related to fashion.A Q&A will follow.",
      "location": "Alvin Johnson/J.M. Kaplan Hall",
      "url": "https://event.newschool.edu/fashionact",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "faculty",
        "staff",
        "students",
        "fashion",
        "environment, sustainability, and climate change",
        "humanity, society, social justice",
        "politics, policy and government",
        "parsons school of design",
        "conferences",
        "alvin johnson/j.m. kaplan hall",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T18:00:00+00:00",
      "end_date": "2024-10-09T20:00:00+00:00"
    },
    {
      "title": "Launch | Twenty-Four Seconds from Now by Jason Reynolds",
      "description": "Firsts are a big deal, especially for Neon and Aria. They're in love, and it all leads to one very big moment... if Neon can just get out of his own way. Join JASON REYNOLDS as he shares his new YA title, Twenty-Four Seconds from Now...!About the Book:Twenty-four months ago: Neon gets chased by a dog all around the church parking lot. A moment he would have loved to forget if it weren’t for the dog’s owner: Aria. Dressed in sweats, a t-shirt, hair in a ponytail. Way more than fine.Twenty-four weeks ago: Neon’s dad insists on talking to him about tenderness and intimacy. Neon and Aria are definitely in love, and while they haven’t taken that next big step… yet, they’ve starting talking about… that.Twenty-four days ago: Neon’s mom finds her — gulp — bra in his room. Hey! No judging! Those hook thingies are complicated! So he’d figured he’d better practice.Twenty-four minutes ago: Neon leaves his shift at work, making sure to bring chicken tenders for Aria. They’re definitely not caviar, but they are her favorite.And right this second? Neon is locked in Aria’s bathroom, completely freaking out because twenty-four seconds from now he and Aria are about to…about to… Well, they won’t do anything if he can’t get out of his own head (all the advice, insecurities, and what ifs) and out of this bathroom!What to Know:* The cost of Twenty-Four Seconds from Now gets you an inscribed copy of the book (first names only), and admission to the event.*Books will be inscribed by Jason Reynolds prior to the event and presented at the event.*Meet the Author – All who purchase a book will be able to join the line for a \"Meet and Greet\" photo opportunity with Jason Reynolds. Please have your phone ready before you get to the front of the line.*Book Pick-Up – You will be able to pick up your pre-ordered inscribed copy of Twenty-Four Seconds from Now... after Jason Reynolds' presentation just before getting on the line for the \"Meet and Greet\"*Other Jason Reynolds Titles – You can also add other Jason Reynolds titles to your cart if you'd like them to be available to pick up at the event. All other titles will be signed – but not inscribed. Choose event pickup at checkout. Shop Them Here!*Can't Make It? You can still order your inscribed copy online here!  \"Book + Entry\" Ticket Includes: * A signed/personalized copy of Twenty-Four Seconds from Now...Admission for the ticketholder.\"Book + Entry + 1 Companion\" Ticket includes:A signed/personalized copy of Twenty-Four Seconds from Now...Admission for the ticketholder plus a companion ticket (for minors, or those requiring aid. If more than one companion ticket is needed, please contact us at customerservice@booksofwonder.com) ",
      "location": "Tishman Auditorium, The New School",
      "url": "https://event.newschool.edu/jasonreynoldsbooklaunch",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "Creative Writing"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "slide_events",
        "alumni",
        "faculty",
        "staff",
        "students",
        "creative writing program",
        "writing and literature",
        "schools of public engagement",
        "author readings",
        "tishman auditorium, the new school",
        "author readings and discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T21:30:00+00:00",
      "end_date": "2024-10-09T23:30:00+00:00"
    },
    {
      "title": "ONLINE | Historical and Current Political Realities in the Context of Intractability",
      "description": "This event is part of a four part series. Learn more here.The speakers will address the history and politics of the conflicts in the context of Intractable conflicts. They will also address past and current efforts by Palestinian and Israeli political leaders to produce a negotiated outcome in a context wherein international actors have supported an asymmetrical relationship that favors Israel. The speakers will also provide insight into two key actors in the current conflict: Hamas and the Israeli Settler movement. They will conclude their remarks by proposing their own views on short run and long term strategies to help resolve the conflict.Please note the Community Agreements for this event.",
      "location": "Virtual",
      "url": "https://event.newschool.edu/historicalandcurrentpoliticalrealities",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "online_events_cal",
        "lobbymonitor",
        "general public",
        "bachelors program for adults and transfer students",
        "civic engagement and social justice",
        "psychology",
        "education and pedagogy",
        "humanity, society, social justice",
        "international and global affairs",
        "eugene lang college of liberal arts",
        "schools of public engagement",
        "the new school for social research",
        "lectures and talks",
        "virtual",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T22:00:00+00:00",
      "end_date": "2024-10-10T00:00:00+00:00"
    },
    {
      "title": "ONLINE | CTE Information Session",
      "description": "The Certificate in Teaching English to Speakers of Other Languages (CTE) is a highly regarded program for aspiring and working ESL teachers, that emphasizes communicative, content-based, and student-centered learning. The CTE is awarded after successful completion of a structured curriculum of five courses, including a minimum of 30 hours of student teaching. Have questions about the Info Session: Certificate in Teaching English? Contact English Language Studies at elsc@newschool.edu or visit our resource site. ",
      "location": "Online | Zoom",
      "url": "https://event.newschool.edu/cte-info-session-october2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "online_events_cal",
        "alumni",
        "faculty",
        "general public",
        "prospective students",
        "staff",
        "students",
        "education and pedagogy",
        "university",
        "info session/open house",
        "online | zoom",
        "admission info session/open house",
        "online or live streamed"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T22:00:00+00:00",
      "end_date": "2024-10-09T23:00:00+00:00"
    },
    {
      "title": "\"The dream of the audience:\" A Film Screening and Performance by Christina Cha on her aunt Theresa Hak Kyung Cha",
      "description": "In her poetry, writing, and notes, the late artist and poet Theresa Hak Kyung Cha frequently wrote about the audience, as “my distant audience,” “a distant relative” and “I want to be the dream of the audience.” In her new extraordinary film and non-fiction writing, Therea Hak Kyung Cha's niece Christina Cha addresses her late aunt as her audience and as an intimate relative, and \"dream of the audience.” Through her  powerful documentary You Are My Audience and writing on her late aunt, Christina Cha features her family’s negotiation of her aunt’s tragic assault and murder just a week after the publication of her formative book Dictee. This event includes also a screening of a short film On Dictee, 2023 by filmmaker Linden Renz.Artist Statement: Linden Renz is a filmmaker, creative producer, and TNS graduate living in New York City. On Dictee is an audio-visual entanglement with the work of Theresa Hak Kyung Cha and her encounters in Dictee with pre-verbal, non-linear thought as the germ of speech.   “The Dream of the Audience” is a special session of the graduate seminar \"Critical Gestures/Creative Queries\" and an event for Art Writing concentration in the Creative Writing MFA Program at The New School.  Q/A moderated by Margaret Rhee, Assistant Professor of Writing Across Media and Chair of Art Writing ",
      "location": "66 W 12th St ",
      "url": "https://event.newschool.edu/thedreamoftheaudienceafilmscre",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "Creative Writing"
      ],
      "tags": [
        "online_event_cal",
        "lobbymonitor",
        "general public",
        "art, media and technology",
        "creative writing program",
        "media studies",
        "arts",
        "media, science, and technology",
        "writing and literature",
        "schools of public engagement",
        "lectures and talks",
        "66 w 12th st ",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-09T23:30:00+00:00",
      "end_date": "2024-10-10T03:59:59+00:00"
    },
    {
      "title": "Start of Semester Celebration",
      "description": "Let’s kick off the semester in style with our annual start of semester brunch on Thursday, October 10th! Join us at the Admin Hub and enjoy a classic NYC bagel spread, coffee, and other refreshments as you connect with new and old colleagues. In addition to brunch, we’ll have on-site photographers to update your professional headshots and our colleagues at The New Store will bring extra school spirit to the Hub with a sustainable mobile pop-up shop! Check out a wide range of featured TNS merchandise and limited-edition items available to staff at an exclusive 15% discount for this event.Stick around afterward and join a Campus Safety presentation immediately after the event at 11:30!Please note: This event is open to New School staff only.",
      "location": "Administrative Hub",
      "url": "https://event.newschool.edu/startofsemester2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "hrevent",
        "staff",
        "human resources",
        "university",
        "receptions",
        "administrative hub"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-10T14:00:00+00:00",
      "end_date": "2024-10-10T15:30:00+00:00"
    },
    {
      "title": "Struggles for Memory against Violences in Mexico Book Launch",
      "description": "Book launch of Struggles for Memory against Violences in Mexico, including panel discussion and reception.The Struggles for Memory against Violences in Mexico documents and analyzes the diversity of collective memory projects throughout Mexico since the start of the “war against drug cartels”, in a context of various intersecting and ongoing forms of violence. There are now more than 110,000 victims of enforced disappearance and the numbers grow every month. Memorialization has been acknowledged as an important tool in the context of mass human rights violations and is often seen as a symbolic form of reparation for the victims, predominantly after regime change or a clearly-defined end to large scale violence. Compared to other cases in Latin America and other parts of the world, this has not been the case in Mexico. The scholars, activists, families of victims, architects and artists that write in this book address the pressing questions that emerge from the particularity of the Mexican case: Why would activists use the language and aesthetics of commemoration in the midst of ongoing violence and human rights abuses? What is the function of commemoration in the absence of peace and justice? What does it mean to commemorate in the absence of evidence and in the absence of bodies (i.e. in the case of the disappeared)?The Struggles for Memory examines historical connections across mobilizations around collective memory in Mexico in the context of the dirty war of the 1960s and 1970s and recent events from the disappearance of the 43 students from Ayotzinapa in 2014, to the women who search for mass graves around the country, among a number of other memorialization efforts around the country, some well-known and others not so widely disseminated. The book challenges the framing of the violence merely as an issue related to drugs and organized crime. These interventions show the continuities in state violence over time, drawing attention to forms of structural violence that cut across enforced disappearances, violence against women, migrant deaths, resource extraction, attacks on activists and journalists, and the enduring discrimination against indigenous peoples and the dispossession of their lands. If you require hybrid access via zoom, please email Alexandra Délano Alonso at delanoa@newschool.edu.",
      "location": "Wollman Hall, 5th Floor",
      "url": "https://event.newschool.edu/strugglesformemoryagainstviole",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "The New School For Social Research"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "slide_events",
        "nd24pp",
        "general public",
        "international and global affairs",
        "intellectual culture and big ideas",
        "schools of public engagement",
        "the new school for social research",
        "author readings",
        "wollman hall, 5th floor",
        "author readings and discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-10T22:00:00+00:00",
      "end_date": "2024-10-11T00:30:00+00:00"
    },
    {
      "title": "\"Legacy of Lies, El Salvador 1981–1984\" Book Launch with Award-winning Photographer Robert Nickelsberg",
      "description": "In the 1980’s, Central America was engulfed in the ramifications of the Cold War, the U.S. defeat in Vietnam, the rivalry between the U.S. government under President Ronald Reagan and the former USSR and Fidel Castro's Cuba.Robert Nickelsberg spent 1981-'84 based in El Salvador photographing for TIME magazine during the worst of its 12 year civil war. In LEGACY OF LIES, Nickelsberg publishes for the first time this series of black and white photos, with essays by four preeminent reporters: Jon Lee Anderson, Carlos Dada, Alma Guillermoprieto and Scott Wallace.",
      "location": "55 WEST 13TH STREET, HIRSHON SUITE, ROOM I203",
      "url": "event.newschool.edu/legacyoflies",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "lectures and talks",
        "55 west 13th street, hirshon suite, room i203",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-10T22:00:00+00:00",
      "end_date": "2024-10-11T00:00:00+00:00"
    },
    {
      "title": "Philosophy Colloquium | Klaus Vieweg, \"Hegel’s Aesthetics of Painting\"",
      "description": "Abstract: What connects Hegel with Rembrandt? What are the important points of contact between the grand master of modern philosophizing and the virtuosos of Dutch painting? Why does Hegel, as an outstanding representative of the school of German Idealism, the golden age of modern philosophy, recognize in the paintings of Rembrandt and the Dutch school of the Golden Age a greatness of spirit and freedom, a revolution in painting, the modernity of this art of painting? Why is Hegel fascinated by such pictures of proud citizens, vegetable and herring sellers, street urchins, the poor and beggars, landscapes and Dutch mills, farmers at harvest and in the inn, women playing the piano, canals with skaters, bouquets of flowers and breakfast tables - depictions of seemingly banal scenes of everyday life?By laying the foundations for a modern aesthetic theory in his lectures on the philosophy of art, Hegel provides decisive arguments against classicist and romanticist devaluations of Dutch Golden Age painting. Against the glorification of antiquity (classicism) and the Christian Middle Ages (late romanticism), his philosophy of art brought about a paradigm shift towards the art of modernity as free art, an art of free spirituality - \"only in its freedom is beautiful art true art\". Hegel can be regarded as the founder of a modern aesthetic of painting in the sense of combining philosophy and art history.Bio: Klaus Vieweg is Professor of Classical German Philosophy at the Friedrich Schiller University, Jena and one of the world's leading Hegel experts. Vieweg has authored or edited over two dozen books, including Hegel. Der Philosophie der Freiheit (Munich: 2019) translated into English as Hegel: The Philosopher of Freedom (Stanford 2023).",
      "location": "The Bark Room - 104",
      "url": "https://event.newschool.edu/philosophycolloquiumklausvieweg",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "philosophy",
        "education and pedagogy",
        "humanity, society, social justice",
        "intellectual culture and big ideas",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "lectures and talks",
        "the bark room - 104",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-10T22:00:00+00:00",
      "end_date": "2024-10-11T00:00:00+00:00"
    },
    {
      "title": "In My Mind 2SLGBTQIA + Black and Peoples of Color Mental Health Conference Day 1",
      "description": "This is a two day event. Please register for Day 2 here.The In My Mind Conference is about, for, and by LGBTQIA+/SGL peoples of color. We believe our 2S-LGBTQIA+/Same-Gender Loving (SGL) peoples of color deserve a future that is free from discrimination, shame, stigma, and have a right to live in communities that nurture and provide support; they are among us, present and visible.“Moving to Thriving and Belonging” -Migrant Communities’ Healing JourneysFocusing on LGBTQIA+ Black and Peoples of Color migrants, asylum seekers and refugees mental health.",
      "location": false,
      "url": "https://event.newschool.edu/inmymind2slgbtqiaday1",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "online_event_cal",
        "lobbymonitor",
        "faculty",
        "students",
        "bachelors program for adults and transfer students",
        "gender and sexuality studies",
        "psychology",
        "faculty/student/alumni/staff research & work",
        "education and pedagogy",
        "humanity, society, social justice",
        "schools of public engagement",
        "conferences",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-11T13:00:00+00:00",
      "end_date": "2024-10-11T21:30:00+00:00"
    },
    {
      "title": "In My Mind 2SLGBTQIA + Black and Peoples of Color Mental Health Conference Day 2",
      "description": "This is a two day event. Please register for Day 1 here.The In My Mind Conference is about, for, and by LGBTQIA+/SGL peoples of color. We believe our 2S-LGBTQIA+/Same-Gender Loving (SGL) peoples of color deserve a future that is free from discrimination, shame, stigma, and have a right to live in communities that nurture and provide support; they are among us, present and visible.“Moving to Thriving and Belonging” -Migrant Communities’ Healing JourneysFocusing on LGBTQIA+ Black and Peoples of Color migrants, asylum seekers and refugees mental health.",
      "location": false,
      "url": "https://event.newschool.edu/inmymind2slgbtqiaday21",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "online_event_cal",
        "lobbymonitor",
        "students",
        "bachelors program for adults and transfer students",
        "gender and sexuality studies",
        "psychology",
        "faculty/student/alumni/staff research & work",
        "education and pedagogy",
        "humanity, society, social justice",
        "schools of public engagement",
        "conferences",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-12T13:00:00+00:00",
      "end_date": "2024-10-12T18:00:00+00:00"
    },
    {
      "title": " Fashion in Between: The Future of Fashion Business",
      "description": "In Partnership with Teen Vogue and the CFDA.Fashion Education Week, brought to you by the Gromek Institute for Fashion Business, proudly presents Fashion In Between: The Future of Fashion Business.This groundbreaking symposium connects academia and industry to spark bold conversations and pioneer innovative solutions within the circular economy. We’ll shine a spotlight on the often-ignored “off-white,” “grey,” and “in-between” spaces of fashion business, society, and creativity—while centering critical themes of intersectionality, sustainability, and social justice.Join hands-on workshops led by top industry leaders, engage in intimate roundtable discussions that challenge the status quo, and participate in community-driven activities designed to inspire real change. Gain exclusive insights and build meaningful connections with professionals shaping the future of fashion.Don't miss this rare opportunity to grow your network, advance your career, and explore the powerful intersection of business strategy, creative practice, and ethical innovation in fashion.Join us from Monday October 14, 2024 to Saturday October 19 for our fashion business summit during Fashion Education Week.Register now to stay up to date with the schedule and guest participants!",
      "location": "Anna-Maria and Stephen Kellen Gallery | Parsons School of Design",
      "url": "https://event.newschool.edu/fewnyc2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "alumni",
        "faculty",
        "general public",
        "prospective students",
        "staff",
        "students",
        "fashion",
        "arts",
        "design",
        "parsons school of design",
        "workshops and training",
        "anna-maria and stephen kellen gallery | parsons school of design",
        "continuing education",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-14T16:00:00+00:00",
      "end_date": "2024-10-20T00:00:00+00:00"
    },
    {
      "title": "Economics Seminar: Neri Salvadori and Heinz Kurtz",
      "description": "Join us October 14 & 15 for two presentations by Professors Neri Salvadori from the University of Pisa and Professor Heinz Kurtz from the University of Graz. *The first presentation, \"Was It A 'Fatal Error'? Sraffa and Samuelson on Marshall’s partial equilibria method,\" will take place Monday, October 14, 2024 at 2pm.*The second presentation, \"Piero Sraffa and counterfactuals: a view from Sraffa's unpublished papers in the late 1920s,\" will take place Tuesday, October 15, 2024 at 4pm.Please register to save your seat, as they will fill out quickly. Non-New School community members: Please register to get access to the buildings, as those that don't and are not on the RSVP list may be refused by security. ",
      "location": "6 East 16th St, Wolff Conference Room, 11th Fl # 1103",
      "url": "https://event.newschool.edu/economicsseminarsalvadorikurtz",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "general public",
        "economics",
        "international and global affairs",
        "intellectual culture and big ideas",
        "the new school for social research",
        "conferences",
        "6 east 16th st, wolff conference room, 11th fl # 1103",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-14T18:00:00+00:00",
      "end_date": "2024-10-15T19:00:00+00:00"
    },
    {
      "title": "Seeds of Sumoud: Palestinian Dignity and the Fight for Food Sovereignty",
      "description": "Please join us for a conversation with Dr. Michael Fakhri, United Nations Special Rapporteur on the Right to Food, alongside Palestinian food activists, seed savers, and chefs in an evening focused on food sovereignty and dignity in Palestine. The event will begin with an overview of Dr. Fakhri’s 2024 UN report “Starvation and the right to food, with an emphasis on the Palestinian people’s food sovereignty,” followed by a discussion with Reem Assil, award-winning Palestinian-Syrian speaker and chef; Laila El-Haddad, journalist and co-author of the critically acclaimed “The Gaza Kitchen: A Palestinian Culinary Journey;” and Vivien Sansour, Founder and Director of The Palestine Heirloom Seed Library. The discussion will be co-moderated by Dr. Fakhri and Dr. Kristin Reynolds, Chair of Food Studies at The New School, with a welcome by Sakiko Fukuda-Parr, Professor of International Affairs at The New School. Small, nourishing bites will be provided to celebrate the steadfastness of Palestinian cuisine and culture, connected to themes of the report.",
      "location": "Wollman Hall",
      "url": "https://event.newschool.edu/seedsofsumoud",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "online_event_cal",
        "lobbymonitor",
        "general public",
        "bachelors program for adults and transfer students",
        "education and pedagogy",
        "humanity, society, social justice",
        "international and global affairs",
        "schools of public engagement",
        "lectures and talks",
        "wollman hall",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-14T22:00:00+00:00",
      "end_date": "2024-10-15T00:00:00+00:00"
    },
    {
      "title": "Critical History Today: America's Illiberal America Past and Present",
      "description": "For this talk, Steven Hahn will examine the deep history of illiberalism and how illiberalism's cultural and political currents have long been close to the surface of American life when they haven't fowed across much that we regard as the mainstream.Steven Hahn is a specialist on the international history of slavery, emancipation, and race, on the construction of American empire, on the social and political history of the “long nineteenth century” in the United States, and on the history of social movements. He has written for The Nation, Dissent, The New Republic, Le Monde Diplomatique, Nexos (Mexico City), and the New York Times, as well as for the American Historical Review, the Journal of Southern History, and Past and Present.This event is part of the Critical History Today lecture series.",
      "location": "WOLFF CONFERENCE ROOM, 6 E. 16TH STREET, 11TH FLOOR",
      "url": "https://event.newschool.edu/stevenhahn",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "historical studies",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "lectures and talks",
        "wolff conference room, 6 e. 16th street, 11th floor",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-14T22:00:00+00:00",
      "end_date": "2024-10-15T00:00:00+00:00"
    },
    {
      "title": "The Westerlies: Wherein Lies The Good",
      "description": "*Please plan ahead and arrive 15 minutes prior to the event. Due to demand, tickets not processed by event start will be released. Thank you!The Westerlies: Wherein Lies The Good The origins of The Westerlies go back to the high school bandrooms of Seattle, Washington, where the four original members first met and came of age together. In this program, the ensemble returns to their roots to celebrate music from their hometown, including Wherein Lies the Good, an expansive work by Robin Holcomb originally written for solo piano, as well as works by her contemporaries Wayne Horvitz, Bill Frisell, and Ron Miles. Repertoire to include:Wherein Lies the Good — Robin HolcombSweeter Than The Day — Wayne HorvitzCupid — Ron MilesMonroe — Bill Frisell All arrangements by The Westerlies.The Westerlies are the Ensemble-in-Residence at the School of Jazz and Contemporary Music at The New School College of Performing Arts  Free with registration / Space is Limited! The Westerlies:The Westerlies, “an arty quartet…mixing ideas from jazz, new classical, and Appalachian folk” (New York Times) are a New York-based brass quartet comprised of Riley Mulherkar and Chloe Rowlands on trumpet, and Andy Clausen and Addison Maye-Saxon on trombone. From Carnegie Hall to Coachella, The Westerlies navigate a wide array of venues and projects with the precision of a string quartet, the audacity of a rock band, and the charm of a family sing-along.Formed in 2011, the self-described “accidental brass quartet” takes its name from the prevailing winds that travel from the West to the East. “Skilled interpreters who are also adept improvisers” (NPR’s Fresh Air), The Westerlies explore jazz, roots, and chamber music influences to create the rarest of hybrids: music that is both \"folk-like and composerly, lovely and intellectually rigorous” (NPR Music).The ensemble has produced numerous critically acclaimed albums of genre-defying music. 2022 saw the release of the Songbook Vol. 2 and Live at TOURISTS on Westerlies Records, the ensemble’s in-house record label. The previous year was a prolific year for the ensemble, with the release of Fireside Brass: A Westerlies Holiday (Westerlies Records), Songbook Vol. 1 (Westerlies Records), and Bricolage (Westerlies Records), a collaborative album of improvisations with pianist/composer Conrad Tao. 2021 also saw the release of This Land, the ensemble’s collaboration with GRAMMY-nominated vocalist Theo Bleckmann. Sought-after collaborators, The Westerlies are also featured on recordings by Fleet Foxes (Nonesuch), Big Red Machine (Jagjaguwar), Vieux Farka Touré (Six Degrees Records), Common (Lakeshore) and Dave Douglas (Greenleaf).Education and community engagement are core elements of The Westerlies' mission. In 2021, The Westerlies were named the inaugural small ensemble-in-residence at the School of Jazz and Contemporary Music at The New School. The Westerlies also produce an annual music festival in Seattle called Westerlies Fest, which combines evening performances featuring numerous guest artists, an all-day open-to-the-public creative music jamboree, and workshops in local public schools. The Westerlies have engaged students of all ages and abilities around the country with their innovative assemblies and masterclasses, promoting the values of cooperation and inclusion through music.This performance will be LIVESTREAMED. VIEWING LINK WILL BE POSTED DAY OF SHOW.More about The Westerlies",
      "location": "Ernst C. Stiefel Concert Hall",
      "url": "https://event.newschool.edu/thewesterliesfall2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "general public",
        "jazz",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "ernst c. stiefel concert hall"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-14T23:30:00+00:00",
      "end_date": "2024-10-15T01:00:00+00:00"
    },
    {
      "title": "Lang Craft Talks featuring Samuel Ace",
      "description": "The Lang Craft Talks series continues with Samuel Ace, a trans/genderqueer poet and sound artist. He is the author most recently of Our Weather Our Sea (Black Radish), Meet Me There: Normal Sex & Home in three days. Don’t wash. (Belladonna* Germinal Texts), and Stealth with poet Maureen Seaton (Chax). Chapbooks include: What started / this mess (above/ground press); Madame Curie’s Notebook (with Maureen Seaton, Artefakta); Triple # 11: The Road to the Multiverse; and Triple #18: A minor history / of secret knowledge (with Maureen Seaton, Ravenna Press). Ace is the recipient of the Astraea Lesbian Writer Award and the Firecracker Alternative Book Award in Poetry, as well as a repeat finalist for both the Lambda Literary Award and the National Poetry Series. Lang hosts a series of weekly dynamic and interactive lessons in the craft of writing. Each week features a different writer including Lang faculty, alumni and special guest writers.  Visit the Lang Craft Talks Hub for the full line-up of writers this spring!",
      "location": "Virtual",
      "url": "https://event.newschool.edu/samuelace",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "eugene lang college of liberal arts",
        "lectures and talks",
        "virtual",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-15T16:30:00+00:00",
      "end_date": "2024-10-15T17:30:00+00:00"
    },
    {
      "title": "After Sherman Screening and Conversation with Jon-Sesrie Goff",
      "description": "Join us for a screening of the film After Sherman followed by a conversation with the filmmaker and Lang alumni Jon-Sesrie Goff.“Captivating.  Ambitiously framed… American history is littered with unfinished conversations. If we are smart, we listen, we follow these murmurs and we see where they lead.  Jon-Sesrie Goff does just that in After Sherman. His florid documentary eavesdrops on fragmented dialogues: between father and son, among friends and neighbors, between land and river and, of course, between the past and the present. These conversations are ambitiously framed by the director, in his notes, as meditations on inheritance and our nation’s twisted history. And while After Sherman fulfills that mission, it’s most captivating when it burrows into Goff’s personal history, recording the stories and rituals of his Gullah Geechee community” — The Hollywood Reporter, Lovia Gyarke",
      "location": "66 5TH AVENUE, KELLEN AUDITORIUM, ROOM N101",
      "url": "event.newschool.edu/aftersherman",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "alumnievents",
        "screenings",
        "66 5th avenue, kellen auditorium, room n101",
        "film and media screenings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-15T22:00:00+00:00",
      "end_date": "2024-10-16T02:00:00+00:00"
    },
    {
      "title": "Heuss Lecture | Christina Morina, \"A Thousand New Beginnings: Germans and Their Democracy since the 1980s\"",
      "description": " What motivates the federal republic? Nearly 75 years since its creation and more than thirty since reunification, German democracy is under pressure: political extremism is spreading, the major political parties are battling vanishing approval ratings, and resentment and anti-democratic feelings are on the rise. How did we get here?Renowned historian Christina Morina believes that to understand modern German history, we need to stop thinking of it as a straightforward story of democracy and dictatorship. In her new book, Tausend Aufbrüche (A Thousand New Beginnings, English edition in preparation for 2025), she examines countless letters to politicians, petitions, leaflets and other documents to show how citizenship and democracy have meant different things to different people over the past 40 years. For the first time, this political-cultural history of modern Germany looks at the 1989 revolution in light of the history of German democracy – revealing the diverse and stubborn ways in which Germans from all walks of life, east and west, have approached democracy in theory and in practice, how their ideas are shaping the so-called Berlin Republic, and the associated opportunities and dangers.Christina Morina is the 2024-2025 Visiting Heuss Professor in History at The New School for Social Research. She is Professor of General History with a particular focus on Contemporary History at the University of Bielefeld. Her research focuses on major themes in German and European history from the in 19th to the 21st century, particularly Nazism and the history of bystanding during the Holocaust; socialism, Marxism and communism; political and memory culture(s) in Germany since 1945, as well as the history of historiography.This annual Heuss Lecture is part of The New School for Social Research's General Seminar event series. Open to New School community members only. Must have an @newschool.edu email address to register.",
      "location": "Wolff Conference Room D1103, 6 E. 16th St.",
      "url": "https://event.newschool.edu/heusslecturechristinamorina",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "alumni",
        "faculty",
        "staff",
        "students",
        "international and global affairs",
        "intellectual culture and big ideas",
        "politics, policy and government",
        "the new school for social research",
        "lectures and talks",
        "wolff conference room d1103, 6 e. 16th st.",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-16T18:00:00+00:00",
      "end_date": "2024-10-16T19:30:00+00:00"
    },
    {
      "title": "Graduate Fair at The New School",
      "description": "Join The New School and other institutions at our Graduate Fair on Wednesday, October 16, 2024! Meet representatives from regional universities in one space, and learn more about their programs. Participating colleges and universities are listed below; additional institutions will be added as the event approaches.We look forward to seeing you!  Best Regards,Office of Graduate AdmissionThe New School ",
      "location": "The New School University Center",
      "url": "https://event.newschool.edu/gradfair24attendee",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "The New School For Social Research",
        "University Level"
      ],
      "tags": [
        "prospective students",
        "admissions",
        "schools of public engagement",
        "the new school for social research",
        "university",
        "festivals and fairs",
        "the new school university center"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-16T22:00:00+00:00",
      "end_date": "2024-10-17T01:00:00+00:00"
    },
    {
      "title": "Screening of the documentary “No Other Land”",
      "description": "Basel Adra, a young Palestinian activist from Masafer Yatta, has been fighting his community's mass expulsion by the Israeli occupation since childhood. Basel documents the gradual erasure of Masafer Yatta, as soldiers destroy the homes of families - the largest single act of forced transfer ever carried out in the occupied West Bank. He crosses paths with Yuval, an Israeli journalist who joins his struggle, and for over half a decade they fight against the expulsion while growing closer. Their complex bond is haunted by the extreme inequality between them: Basel, living under a brutal military occupation, and Yuval, unrestricted and free. This film, by a Palestinian-Israeli collective of four young activists, was co-created during the darkest, most terrifying times in the region, as an act of creative resistance to Apartheid and a search for a path towards equality and justice.Please note the Community Agreements for this event.",
      "location": "Kellen Auditorium (N 101) ",
      "url": "https://event.newschool.edu/nootherlandscreening",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "online_events_cal",
        "lobbymonitor",
        "general public",
        "bachelors program for adults and transfer students",
        "psychology",
        "education and pedagogy",
        "humanity, society, social justice",
        "international and global affairs",
        "eugene lang college of liberal arts",
        "schools of public engagement",
        "the new school for social research",
        "screenings",
        "kellen auditorium (n 101) ",
        "film and media screenings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-16T22:00:00+00:00",
      "end_date": "2024-10-17T01:00:00+00:00"
    },
    {
      "title": "The Myth of American Idealism: How U.S. Foreign Policy Endangers the World",
      "description": "A panel discussion and Q&A on the ideas and work of Noam Chomsky, including his new book: The Myth of American Idealism with the book's co-author Nathan Robinson, who is also the editor-in-chief of Current Affairs magazine.Speakers will examine Chomsky's critiques of U.S. foreign policy from Vietnam to Iraq to Gaza and discuss why his searing analysis of U.S. power remains vital and relevant.The panel of speakers will be comprised of those who have worked with or been inspired by Chomsky's writings over the last 50 years: Amy Goodman - Host of the independent global news program Democracy Now! since 1996, author of six books, winner of the I.F. Stone Medal for Journalistic Independence and the Gandhi Peace AwardBev Stohl - ran Prof. Chomsky's office at the Massachusetts Institute of Technology for over 20 years and is the author of Chomsky and Me: A Memoir. Greg Grandin - professor of history at Yale University, author of Kissinger's Shadow, Empire's Workshop, and Fordlandia: The Rise and Fall of Henry Ford's Forgotten Jungle City, which was a finalist for the Pulitzer Prize for History and the National Book Award. Victor Pickard - Media studies professor, Annenberg School for Communication at the University of Pennsylvania, author of America’s Battle for Media Democracy: The Triumph of Corporate Libertarianism and the Future of Media Reform and Democracy Without Journalism?: Confronting the Misinformation Society.",
      "location": "Room UL104, University Center, The New School",
      "url": "https://event.newschool.edu/themythofamericanidealism",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "Graduate Program and International Affairs"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "slide_events",
        "general public",
        "julien j. studley graduate programs in international affairs",
        "international and global affairs",
        "schools of public engagement",
        "lectures and talks",
        "room ul104, university center, the new school",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-16T22:30:00+00:00",
      "end_date": "2024-10-17T00:00:00+00:00"
    },
    {
      "title": "A Conversation with Haben Girma – The First Deafblind Woman Who Conquered Harvard Law",
      "description": "Haben Girma is a disability rights lawyer, an advocate, and a White House Champion for Change, a title designated to her by President Barack Obama. She is generously sharing her wisdom, knowledge and experiences of navigating unchartered territories and self-advocacy with our community. She has been a force for positive change throughout the world from advocating for her own rights, to sharing her authentic experiences in her book (Haben: The Deafblind Woman Who Conquered Harvard Law) to traveling around the world and advocating for people with disabilities, she is a trail blazer in this world and has shown us a pathway for being better human beings and doing more from where we stand. In this moderated conversation she will be discussing themes ranging from living with a disability with multiple marginalized identities, to how to advocate for change and strategies for being thoughtful, anti-ableist, inclusive and innovative designers.This will be a hybrid event gathering virtually or at University Center, 63 5th Avenue, Room L 105 (lower level).Please register by clicking on the red 'Register' button to attend.",
      "location": "Hoerle Lecture Hall - Room U L105",
      "url": "https://event.newschool.edu/habengirmainconversation",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Parsons School of Design"
      ],
      "tags": [
        "eisjweb",
        "lobbymonitor",
        "online_events_cal",
        "slide_events",
        "general public",
        "fashion",
        "arts",
        "design",
        "humanity, society, social justice",
        "parsons school of design",
        "lectures and talks",
        "hoerle lecture hall - room u l105",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-16T23:00:00+00:00",
      "end_date": "2024-10-17T00:00:00+00:00"
    },
    {
      "title": "Settler Colonialism and Genocide: From Palestine to Turtle Island",
      "description": "Announcing “Settler Colonialism and Genocide: From Palestine to Turtle Island”, with J. Kēhaulani Kauanui and Rashid Khalidi. Introduced and moderated by Sean Jacobs, Mellon Initiative Fellow 2024/25. We are thrilled to announce the first Mellon Initiative guest speaker event of the academic year. The talk, “Settler Colonialism and Genocide: From Palestine to Turtle Island”, will feature dialogue between Professors J. Kēhaulani Kauanui (Princeton University) and Rashid Khalidi (Columbia University). Sean Jacobs, Mellon Initiative Fellow 2024/25, will moderate the discussion. Both scholars are deeply engaged in research focusing on issues of settler colonialism and decolonization, indigeneity, race and ethnicity, nationalism and national identity, and other critical topics. This talk aims to bridge their work and explore connections between Palestine and Turtle Island.About the SpeakersJ. Kēhaulani KauanuiJ. Kēhaulani Kauanui, Ph.D. (Kanaka Maoli/Native Hawaiian) is Eric and Wendy Schmidt Professor of Indigenous Studies, Professor of Anthropology in the Effron Center for the Study of America and the Department of Anthropology at Princeton University. Her research focuses on Native American and global indigeneities, settler colonialism and decolonization, race and ethnicity, gender & sexuality, and anarchist politics. She is the author of Hawaiian Blood: Colonialism and the Politics of Sovereignty and Indigeneity (Duke University Press 2008); and Paradoxes of Hawaiian Sovereignty: Land, Sex, and the Colonial Politics of State Nationalism (Duke University Press 2018). She also has an edited book titled, Speaking of Indigenous Politics: Conversations with Activists, Scholars, and Tribal Leaders (University of Minnesota Press 2018) which includes select interviews drawing from her vast archive of a public affairs radio program, “Indigenous Politics: from Native New England and Beyond,” which was produced in the studios of WESU (Middletown, CT) from 2007-2013, and aired on over a dozen stations through the Pacifica Radio Network. Her work is widely published in a range of academic journals and edited books, and she also co-edits a book series on “Critical Indigeneities” for the University of Carolina Press. Kauanui is one of the six co- founders of the Native American and Indigenous Studies Association, established in 2008. And she is the recipient of the Western History Association’s 2022 American Indian History Lifetime Achievement Award.Rashid KhalidiRashid Khalidi is the Edward Said Professor of Modern Arab Studies Emeritus at Columbia University. He received a B.A. from Yale University in 1970, and a D.Phil. from Oxford University in 1974. He has taught at the Lebanese University, the American University of Beirut, and the University of Chicago. He is a past President of the Middle East Studies Association, and was editor and then co-editor of the Journal of Palestine Studies.Khalidi is the author of: The Hundred Years’ War on Palestine: A History of Settler Colonialism and Resistance, 1917-2017 [2020: MEMO Book Award]; Brokers of Deceit: How the U.S. has Undermined Peace in the Middle East [2013: Lionel Trilling Book Award; MEMO Book Award]; Sowing Crisis: American Dominance and the Cold War in the Middle East [2009]; The Iron Cage: The Story of the Palestinian Struggle for Statehood [2006]; Resurrecting Empire: Western Footprints and America’s Perilous Path in the Middle East [2004]; Palestinian Identity: The Construction of Modern National Consciousness [1997: Middle East Studies Association’s Albert Hourani Prize; reissued with a new introduction in 2010]; Under Siege: PLO Decision-making during the 1982 War [1986; reissued with a new preface in 2014]; and British Policy towards Syria and Palestine, 1906-1914 [1980]. His books have been translated into a dozen languages. He has written over 100 scholarly articles, and is the co-editor of Palestine and the Gulf [1982]; The Origins of Arab Nationalism [1991]; and The Other Jerusalem: Rethinking the History of the Sacred City [2020].  Sean JacobsSean Jacobs is a professor of international affairs at The New School and publisher of Africa Is a Country. He was born and grew up in Cape Town, South Africa. His Mellon Initiative Fellowship project focuses on developing a handbook to provide foundational resources for research on decolonizing international affairs and reshape how the discipline is taught.",
      "location": "Sheila C. Johnson Design Center - Anna-Maria and Stephen Kellen Auditorium (Room N101)",
      "url": "event.newschool.edu/settlercolonialismgenocide",
      "source": "The New School",
      "university": "The New School",
      "department": [],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "sparksymposia24",
        "lectures and talks",
        "sheila c. johnson design center - anna-maria and stephen kellen auditorium (room n101)",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-17T20:00:00+00:00",
      "end_date": "2024-10-17T22:00:00+00:00"
    },
    {
      "title": "How (Not) to Build a Bunker, Day 1: Reinvigorating Democracy—Rejecting AI Apocalypticism and Resisting the Rush to Build AGI",
      "description": "The Arendt/Shürmann Symposium at the Philosophy Department of The New School for Social Research presents this two-day conference running October 17-18, 2024. Please click here to register for Day Two on October 18.The world is spiraling into climate chaos, and artificial intelligence (AI), despite its apparent promise, threatens democratic institutions the world over. What is driving the current race to build artificial general intelligence, or AGI? Why are tech billionaires like Elon Musk so obsessed with colonizing space and anxious about population decline? One aim of this symposium is to better understand the mindsets, both utopian and apocalyptic, that have become pervasive within Silicon Valley and beyond. We will consider a cluster of interrelated ideologies that inform these mindsets, among others, Effective Altruism (EA), transhumanism, longtermism, effective accelerationism, and singularitarianism. We hope to identify meaningful and effective strategies to counteract their growing influence. Speakers: Amitav Ghosh, Tyler A. Harper, Audra Mitchell, Douglas  Rushkoff, Alexander ThomasHosted by: Alice Crary and Émile Torres THURSDAY, OCTOBER 17 - DAY ONE5:30PM – Welcome Reception 6:00-6:15PM – Welcome and introduction, ALICE CRARY and ÉMILE P. TORRES 6:15-7:45PM – DOUGLAS RUSHKOFF (Professor of Media Theory and Digital Economics, Queens College; Author of Survival Of The Richest: Escape Fantasies Of The Tech Billionaires), “We Are As Gods: Deconstructing The Tech Bro Mindset” 7:45 PM – Reception with light fare and drinks",
      "location": "Wolff Conference Room D1103",
      "url": "https://event.newschool.edu/hownottobuildabunkerday1",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "philosophy",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "conferences",
        "wolff conference room d1103",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-17T21:30:00+00:00",
      "end_date": "2024-10-18T03:59:59+00:00"
    },
    {
      "title": "Creative Queries: Critical Gestures - Race, Indigeneity, Queerness, and Difference",
      "description": " Join National Book Award Winner Craig Santos Perez and UCSC Director of Creative Writing Ronaldo V. Wilson for special performances and dialogue on writing across genre and race, indigeneity, queerness, and difference. As a special event for the Art Writing Concentration, the event fosters the stakes and possibilities of creative and critical writing in our contemporary moment. The dialogue will be moderated by Arts Writing Chair Margaret Rhee. ",
      "location": "Room UL104",
      "url": "https://event.newschool.edu/craigsantosperezandronaldowils",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "Creative Writing"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "creative writing program",
        "writing and literature",
        "schools of public engagement",
        "author readings",
        "room ul104",
        "author readings and discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-17T22:00:00+00:00",
      "end_date": "2024-10-17T23:00:00+00:00"
    },
    {
      "title": "How (Not) to Build a Bunker, Day 2: Reinvigorating Democracy—Rejecting AI Apocalypticism and Resisting the Rush to Build AGI",
      "description": "The Arendt/Shürmann Symposium at the Philosophy Department of The New School for Social Research present this two-day conference running October 17-18, 2024. Please click here to register for Day One on October 17.The world is spiraling into climate chaos, and artificial intelligence (AI), despite its apparent promise, threatens democratic institutions the world over. What is driving the current race to build artificial general intelligence, or AGI? Why are tech billionaires like Elon Musk so obsessed with colonizing space and anxious about population decline? One aim of this symposium is to better understand the mindsets, both utopian and apocalyptic, that have become pervasive within Silicon Valley and beyond. We will consider a cluster of interrelated ideologies that inform these mindsets, among others, Effective Altruism (EA), transhumanism, longtermism, effective accelerationism, and singularitarianism. We hope to identify meaningful and effective strategies to counteract their growing influence. Speakers: Amitav Ghosh, Tyler A. Harper, Audra Mitchell, Douglas  Rushkoff, Alexander Thomas Hosted by: Alice Crary and Émile Torres FRIDAY, OCTOBER 1810:00-10:15AM – Coffee and bagel spread  10:15-11:45AM – AUDRA MITCHELL (Canada Research Chair in Global Political Ecology, Balsillie School of International Affairs/Wilfrid Laurier University/University of Waterloo) “Another End Of The World Is Possible: Cultivating Anti- Oppressive Futures,”Moderated by ROMY OPPERMAN (NSSR) 11:45AM-12:00PM – Coffee break 12:00-1PM – ÉMILE P. TORRES (Inamori International Center for Ethics and Excellence, Case Western Reserve University), “From Techno-Utopian to Ardent Apostate: Why I Joined The Tescreal Movement And Later Defected,” in conversation with ALICE CRARY (NSSR) 1:00-2:00PM – Lunch 2-3:30PM – TYLER A. HARPER (Assistant Professor of Environmental Studies, Bates College), title TBA, in conversation with ÉMILE P. TORRES 3:30-3:45PM – Coffee break  3:45-4:45PM – ALEXANDER THOMAS (Senior Lecturer in Media Production and Film, University of East London), “Exiting The Tangled Web of Being: Transhumanism and The Fantasy Of Techno-Transcendence,” in Conversation with MOLLIE GLEIBERMAN (PhD candidate at The Institute of Development Policy, University of Antwerp, Thesis: “The Myth Of Effective Altruism”) 4:45-5:00PM – Coffee break  5:00-6:00PM – AMITAV GHOSH (Distinguished Novelist and Non-Fiction writer), a discussion of his 2021 book The Nutmeg's Curse: Parables for  a Planet in Crisis, in conversation with ALICE CRARY (NSSR)",
      "location": "Wolff Conference Room D1103",
      "url": "https://event.newschool.edu/hownottobuildabunkerday2",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "philosophy",
        "humanity, society, social justice",
        "intellectual culture and big ideas",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "conferences",
        "wolff conference room d1103",
        "conferences and symposia"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-18T14:00:00+00:00",
      "end_date": "2024-10-19T03:59:59+00:00"
    },
    {
      "title": "Family Weekend 2024",
      "description": "The New School is thrilled to welcome parents and families to participate in Family Weekend, which will be held October 18-20, 2024. Make connections with other New School families, spend quality time with your New School student, meet university leadership and explore New York City. Registration will open on Monday, September 16. Please be sure to register for each individual event in which you would like to participate. All attendees will require registration.If you have questions, please email us at families@newschool.edu. ",
      "location": "The New School",
      "url": "https://event.newschool.edu/familyweekend2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "University Level"
      ],
      "tags": [
        "general public",
        "students",
        "student success office",
        "university",
        "fairs & festivals",
        "the new school"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-18T19:00:00+00:00",
      "end_date": "2024-10-20T16:00:00+00:00"
    },
    {
      "title": "States, Citizenship, and Welfare in India and China",
      "description": "In China, recent reforms have aimed at expanding social security coverage, improving healthcare, and addressing rural-urban disparities. India has launched several ambitious welfare schemes aimed at poverty alleviation, healthcare, food security, and right to work programs. By virtue of population size, these programs are among the largest social policy initiatives in the world. But they are also insightful examples of welfare provision based less on rights-based entitlements and more on achieving state goals of development, social stability, political loyalty, and promotion of more exclusive conceptions of citizenship. This panel explores changing welfare policies and politics in China and India, and their roles in anchoring new forms of authoritarian or illiberal governance. ",
      "location": "Starr Foundation Hall",
      "url": "https://event.newschool.edu/statescitizenshipandwelfare",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "The New School For Social Research",
        "Parsons School of Design",
        "Eugene Lang College Of Liberal Arts",
        "University Level",
        "College Of Performing Arts"
      ],
      "tags": [
        "general public",
        "provost's office",
        "cities and urbanism",
        "international and global affairs",
        "politics, policy and government",
        "college of performing arts",
        "continuing and professional education",
        "eugene lang college of liberal arts",
        "parsons school of design",
        "schools of public engagement",
        "the new school for social research",
        "university",
        "lectures and talks",
        "starr foundation hall",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-18T20:00:00+00:00",
      "end_date": "2024-10-18T22:00:00+00:00"
    },
    {
      "title": "Ruff Cuts | Fall 2024",
      "description": "This event will be on campus. Registration is required. We are extremely excited to announce the first RUFF CUTS of the Fall 2024 Semester.RUFF CUTS is the School of Media Studies' main screening event, where students and alumni screen their films and receive feedback from their colleagues and professors. The event attracts professors, alumni, festival programmers, industry professionals, and students across the university. It is an incredible opportunity to screen your work-in-progress films, receive feedback, and connect with other talented filmmakers from our community. We usually screen an average of 8 films on a first come, first served basis.  For every RUFF CUTS of the semester, we spotlight a specific person, group, or project that inspires us. The RUFF CUTS 1 Artist Spotlight will focus on Vlad Nikolic, Dean of the School of Media Studies, and his new feature film Everything That Will Happen Has Already Happened. We look forward to seeing you! The deadline to submit work to ruffcuts@newschool.edu is Sunday, October 13th, 2024 (or before).Follow our Instagram for the latest updates! @ruffcuts_tns",
      "location": "Kellen Auditorium ",
      "url": "https://event.newschool.edu/ruffcutsfall2024",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "alumni",
        "faculty",
        "staff",
        "students",
        "media studies",
        "media, science, and technology",
        "schools of public engagement",
        "screenings",
        "kellen auditorium ",
        "film and media screenings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-18T22:00:00+00:00",
      "end_date": "2024-10-19T01:00:00+00:00"
    },
    {
      "title": "Mannes Opera Season Opener~Don Giovanni",
      "description": "Don Giovanni by W. A. Mozart,Arranged by Danyal DhondyJoin us for the Mannes Opera season opener – a classic realized anew. This Don Giovanni is presented in a crisp 100 minutes, with piano, string trio and trombone.Featuring the sonorous acoustics of The New School’s renowned art deco Auditorium on 12th street, this jewel box production serves Mozart’s music and Da Ponte’s storytelling with a twist of horror.Composed by W.A. Mozart, Libretto by L. Da Ponte.Free with Registration.Join us to usher in the 2024/2025 Mannes Opera Season!MANNES OPERAUnder the leadership of Managing Artistic Director Emma Griffin, Mannes Opera is a dynamic training program for operatic artists, marked by a curiosity for new and a devotion to craft. The program utilizes opera as a medium for exploration, improvisation, and creation, providing students with extensive performance opportunities and practice.Recent notable productions include Grace McLean’s In the Green, Cavall’s La Calisto, Nico Muhly’s Dark Sisters, Die Zauberflöte, Rachel J. Peter’s Mermaid in the Jar, and Kate Soper’s Here Be Sirens.  With our commitment to developing and supporting new opera, we have workshopped Missy Mazzoli and Royce Vavrek’s The Listeners, Gregory Spears and Tracy K. Smith’s The Righteous (in collaboration with Santa Fe Opera), and David T. Little’s Agamemnon (in collaboration with Theatre for a New Audience).Our mission is to empower students to become versatile and self-assured professional artists, equipped with the skills and agency to navigate the ever-evolving landscape of the performing arts. Mannes Opera is committed to fostering artistic excellence and innovation, guided by the rich traditions of the past and a bold vision for the future.Mannes Opera’s 2024/25 Season opens with a jewelbox production of Don Giovanni created by Griffin and Mannes faculty member Cris Frisco, presented in a crisp 100 minutes, on October 18 and 19. The Opera in Concert double bill on November 8 and 9 features works by Mannes faculty members and prolific composers, David T. Little (Vinkensport, or the Finch Opera, New York premiere) and Kamala Sankaram (The Infinite Energy of Ada Lovelace), directed by New School Drama alum Alison Pogolrec. On March 7 and 8, Mannes Opera presents Handel’s Alcina at the Gerald W. Lynch Theater, directed by Sam Helfrich and conducted by Mannes alumnus Geoffrey MacDonald. On May 9, Mannes Opera gives a workshop presentation of Hildegard, a new opera by Sarah Kirkland Snider, in collaboration with Beth Morrison Productions.We look forward to seeing you!",
      "location": "The Auditorium at 66 West 12th Street",
      "url": "https://event.newschool.edu/mannesoperadongiovanni",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "general public",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "the auditorium at 66 west 12th street"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-18T23:30:00+00:00",
      "end_date": "2024-10-20T01:00:00+00:00"
    },
    {
      "title": "Mannes Sounds: Sounds of Nature",
      "description": "PROGRAM:Haydn: The Seasons, Hob.XXI:3Summer: “Oh How Pleasing to the Senses” for soprano and organ Grieg: Concert Overture “In the Autumn” Op. 11 for piano four hands          Vaughan-Williams: “Lark Ascending” for violin and piano Schubert: “Die Forelle” Schumann: “Die Lotosblume” Britten: Six Metamorphosis after Ovid, op.49 :Pan for solo oboe (2’23”)           ﻿Debussy: L’Isle Joyeuse Messiaen: “Les Oiseaux et les source” from the Messe de la Pentecôte for organFlorence Price: “Clouds” for pianoJules Mouquet: La Flûte de Pan: Pan et le nymphes for flute and piano         Liszt: Concert Etude “Waldesrauschen” for pianoSaint-Saens: “Swan”Margaret Bond: “ Troubled Water” for piano        Gershwin: \"Walking the Dog\" for clarinet, piano, and string quintet",
      "location": "Madison Avenue Presbyterian Church",
      "url": "https://event.newschool.edu/mannessoundssoundsofnature1",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "alumni",
        "faculty",
        "general public",
        "prospective students",
        "staff",
        "students",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performances",
        "madison avenue presbyterian church",
        "music performances",
        "theater performances"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-20T19:00:00+00:00",
      "end_date": "2024-10-20T21:00:00+00:00"
    },
    {
      "title": "Lang Craft Talks featuring jason b. crawford",
      "description": "The Lang Craft Talks series continues with jason b. crawford (They/He/She), a New School alum and Washington DC born writer, raised in Lansing, Michigan. Their debut Full-Length Year of the Unicorn Kidz is out from Sundress Publications. crawford holds a Bachelor of Science in Creative Writing from Eastern Michigan University. They are a 2023 Lambda Literary Emerging LGBTQ Voices fellow. They are the winner of the Courtney Valentine Prize for Outstanding Work by a Millennial Artist, the winner of the Rhino’s Founders Prize, and a finalist for the Frontier’s Open prize. crawford was a finalist for the Tom Howard/Margaret Reid 2021 and 2022 Poetry Contest. Their work can be found or is forthcoming in POETRY Magazine, Metro Weekly, AGNI Magazine, Foglifter Magazine, Four Way Review, Cincinnati Review, Frontier Magazine, Beloit Poetry Journal, among others. They hold an MFA in poetry from The New School. Their second collection YEET! was the winner of the 2023 Omnidawn 1st/2nd Book Prize and will be published in Fall 2025.Lang hosts a series of weekly dynamic and interactive lessons in the craft of writing. Each week features a different writer including Lang faculty, alumni and special guest writers.  Visit the Lang Craft Talks Hub for the full line-up of writers this spring!",
      "location": "Virtual",
      "url": "https://event.newschool.edu/jasoncrawford",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "eugene lang college of liberal arts",
        "lectures and talks",
        "virtual",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-22T16:30:00+00:00",
      "end_date": "2024-10-22T17:30:00+00:00"
    },
    {
      "title": "José Maurício Domingues | Liberalism & Republicanism: From Expansion to Retraction",
      "description": "Political modernity set off, through liberalism and a modern form of republicanism, programmatically and historically, with a rather oligarchical and abstract perspective. Accordingly, most citizens – if they were citizens at all – did not participate, at least fully, in the political system and had only civil rights – limited in particular for women but also for specific groups of the population, foremostly slaves. Abstractness hid however these concrete issues, besetting workers and the popular classes in general, as well as women, also in their plebeian political being. Abstractness implied also the personalization and personification of politics should be strictly limited. Through social and political struggles concreteness penetrated however the structure of the state, democratizing the political system of liberal republicanism, broadening political rights, and introducing social policies and rights, tending often to universalization. Highly oligarchical mass organizations – parties, unions, associations, churches – were crucial for this expansive moment. This movement has been reversed since the 1970s, implying a moment of retraction of republican liberalism towards a sort of de-democratized advanced oligarchical political system, despite the formal trappings of democracy, and the restriction of social policies, concentrated on the poor rather them aiming at the citizen. Concreteness has not disappeared, though, with society cut out in different groups and the personalization and personification of politics (so-called “populism”). This movement is internal rather than inimical to liberalism. At the same time, the “real socialist” (authoritarian collectivism) failed and returned to capitalism, although keeping the party-state form. It does not appear any longer as an alternative at all. The question that remains is whether republican liberalism can resume its expansive movement or whether, as authoritarian collectivism, it is exhausted in its creative capacities and historical dynamics and in terms of propelling social forces.",
      "location": "Wolff Conference Room",
      "url": "https://event.newschool.edu/liberalismrepublicanism",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "general public",
        "politics",
        "intellectual culture and big ideas",
        "the new school for social research",
        "lectures and talks",
        "wolff conference room",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-22T22:00:00+00:00",
      "end_date": "2024-10-23T00:00:00+00:00"
    },
    {
      "title": "Pleistocene Park: Engineering Wilderness in a More-than-Human World",
      "description": "Pleistocene Park is a large-scale science experiment in Arctic Siberia in the form of a future-oriented rewilding project with the goal of mitigating climate change. The Park’s creators hypothesize that introducing large herbivores into the area will slow the thawing of permafrost. Using the approach of multispecies ethnography, in attending to the nonhuman agencies at work in the project, Anya Bernstein (Harvard) argues that the Park differs from other rewilding projects, which are usually ecocentric, in emerging as a survivalist project with a distinct anthropocentric bent. Even so, however, the Park’s survivalist goal for humans coexists with ontologies based on collaboration and mutual aid between humans and nonhumans, and between organic and inorganic matter, with extensive agency assigned to nonhuman others. Drawing on ethnographic fieldwork within the frame of the Park’s various genealogies, she traces the project’s underlying assumptions in equal measure to the history of Russian science and to the experience of the Park’s lead scientists of sociopolitical rupture following the collapse of the Soviet Union. As a case study, Pleistocene Park is especially suited to exploring issues of time and temporality, apocalypticism and redemption, extinction and eternity, in addition to particular visions of the natural and the human.",
      "location": "Wolff Conference Room",
      "url": "https://event.newschool.edu/pleistocenepark",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research"
      ],
      "tags": [
        "general public",
        "anthropology",
        "intellectual culture and big ideas",
        "the new school for social research",
        "lectures and talks",
        "wolff conference room",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-23T22:00:00+00:00",
      "end_date": "2024-10-24T00:00:00+00:00"
    },
    {
      "title": "Luis Jaramillo Book Launch",
      "description": "Join us for a reading with author Luis Jaramillo as he sits down with Mira Jacob to discuss his new work. Luis Jaramillo is the author of The Witches of El Paso. He is also the author of the award-winning short story collection The Doctor’s Wife. His writing has appeared in Literary Hub, BOMB Magazine, the Los Angeles Review of Books, and other publications. His honors include fellowships from Aspen Words, the Sewanee Writers Conference, and the New York Institute for the Humanities. He is an assistant professor of creative writing at The New School. He received an undergraduate degree from Stanford University and an MFA in creative writing from The New School.",
      "location": "Room A-407",
      "url": "https://event.newschool.edu/luisjaramillobooklaunch",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement",
        "Creative Writing"
      ],
      "tags": [
        "lobbymonitor",
        "online_events_cal",
        "general public",
        "creative writing program",
        "writing and literature",
        "schools of public engagement",
        "author readings",
        "room a-407",
        "author readings and discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-23T22:00:00+00:00",
      "end_date": "2024-10-23T23:00:00+00:00"
    },
    {
      "title": "IN-PERSON & ONLINE | Vera List Center Forum 2024: Correct* History",
      "description": "Forgoing the expected stylization—be it the imperative: Correct history! a call to revise and rewrite it, or the interrogative, Correct history?, questioning whether there might be a singular narrative—the asterisk in the title Correct History* suggests a more conditional and hypothetical approach. VLC Forum 2024: Correct History* explores the ways in which history and historiography invariably function as acts of correction and revision while examining some of the ideological mechanisms that drive them. Discursive strands come together to consider how historical narratives and ideological formations are created, edited, altered, and contested, including historical revisionism, whitewashing, and rehabilitation by state and other hegemonic political actors. Over three days, the VLC Forum brings together scholars, artists, and curators whose reparative and recuperative artistic strategies point toward ways of redressing historical injustice, restitution of artifacts, memorialization, and negotiating conflict, competing claims, and historical relatedness. Please visit the individual event pages for more information and to register to attend.",
      "location": "In-person and Online",
      "url": "https://event.newschool.edu/veralistcenterforumcorrecthist",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "online_events_cal",
        "general public",
        "arts",
        "intellectual culture and big ideas",
        "schools of public engagement",
        "conferences",
        "in-person and online",
        "conferences and symposia",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-24T22:00:00+00:00",
      "end_date": "2024-10-26T21:00:00+00:00"
    },
    {
      "title": "Philosophy Colloquium | Mohamed Amer Meziane, \"Of Subterranean Imperiality: Heaven, Earth, and the Accumulation of Capital\"",
      "description": "How is the State involved in the climate crisis? Drawing on The States of the Earth (Verso, 2024), Mohamed Amer Meziane (Brown University) will attempt to develop a theory of what he calls the Fossil State, partly based on a critical dialogue with Marxism that differs from most eco-socialist perspectives. He will suggest that the concept of imperiality (not coloniality) might help us analyze the theologico-political knot underpinning the modern capitalist State in both its religious and secular forms. Because the State never exists as an isolated entity but as part of a system of interconnected states, I will turn to inter-imperiality to describe aspects of the geopolitics of climate beyond the opposition between war and peace. By reinterpreting “primitive accumulation” in terms not only of State/colonial violence but of imperial secularization (not secularism), he thus wants to contribute to a different understanding of the entanglements of colonialism and capital and to try and find overlaps between eco-Marxist and anti-colonial approaches.Bio: Mohamed Amer Meziane holds a PhD in Philosophy and Intellectual History from the University of Paris 1 Panthéon-Sorbonne. After teaching at Columbia University as a Postdoctoral Research Fellow at the Institute for Religion, Culture and Public Life, he joined Brown University as an Assistant Professor of Francophone Humanities and Middle East Studies affiliated with the Watson Institute. He is the author of The States of the Earth: An Ecological and Racial History of Secularization. The book won the Albertine Prize for non-fiction in 2023 and was published in English in April 2024 by Verso Books. His second book was published in French in 2023. It is titled: Au bord des mondes. Vers une anthropologie métaphysique (At the Edge of the Worlds: Towards a Metaphysical Anthropology). His books have been reviewed in several media such as Le Monde, Mediapart and The Los Angeles Review Books. He is also invited to write texts about several contemporary artists for exhibitions catalogs, art galleries or journals such as Flash Art. ",
      "location": "Wolff Conference Room/D1103",
      "url": "https://event.newschool.edu/mohamedamermeziane",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "philosophy",
        "humanity, society, social justice",
        "intellectual culture and big ideas",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "lectures and talks",
        "wolff conference room/d1103",
        "lectures and panel discussions"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-24T22:00:00+00:00",
      "end_date": "2024-10-25T00:00:00+00:00"
    },
    {
      "title": "VLC Forum 2024: Re-visioning Native Histories",
      "description": "In an expansive conversation, Cree artist Kent Monkman and Nathan Young, a member of the Delaware Tribe of Indians, revisit some of the foundational narratives of the so-called United States of America, centering Indigenous figures, events, and narratives that have been erased and denied as part of the settler-colonial project. Drawing on their own expansive artistic and scholarly work, including Monkman’s widely-exhibited paintings that intervene in Western European and American art history and Young’s Nkwiluntàmën, a site-specific, sound-based installation in the landscape surrounding Pennsbury Manor, a reconstruction of the home of Pennsylvania founder William Penn, their conversation reckons with the processes of colonial erasure, the trope of “discovery,” unmaking of history, and Indigenous visual and sonic agency in contending with a settler-colonial history and the complexities of historic and contemporary Indigenous experiences. VLC Borderlands Curatorial Fellow Larissa Nez (Diné) introduces and moderates the conversation to ask: How can artists and historians correct or produce a “correct” record of Indigenous histories? How can historical scholarship and artistic practice work in tandem to re-envision Native pasts and futures?This program launches the VLC Forum 2024 and includes a festive reception.This event is part of the Vera List Center Forum 2024: Correct* History, please visit here for more information.",
      "location": "The New School, Wollman Hall",
      "url": "https://event.newschool.edu/vlcforum2024correcthistoryre-v",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "eisjweb",
        "online_events_cal",
        "slide_events",
        "general public",
        "arts",
        "humanity, society, social justice",
        "intellectual culture and big ideas",
        "schools of public engagement",
        "lectures and talks",
        "the new school, wollman hall",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-24T22:30:00+00:00",
      "end_date": "2024-10-25T00:30:00+00:00"
    },
    {
      "title": "New School Studio Orchestra Performs the Music of Bob Brookmeyer",
      "description": "The NSSO is back! The New School Studio Orchestra kicks off its three concert series with Bob Brookmeyer compositions and arrangements from across his entire career. Special guest artists to be announced! The College of Performing Arts's newest large ensemble, the New School Studio Orchestra is composed of students from the School of Jazz and Contemporary Music and the Mannes School of Music, performing music from a wide variety of genres including jazz, soul, pop, and improvised music.  Join us!  Free with registration.",
      "location": "John L. Tishman Auditorium",
      "url": "https://event.newschool.edu/nssobobbrookmeyer",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Mannes",
        "College Of Performing Arts"
      ],
      "tags": [
        "lobbymonitor",
        "slide_events",
        "general public",
        "jazz",
        "mannes school of music",
        "performing arts",
        "college of performing arts",
        "performance",
        "john l. tishman auditorium"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-24T23:30:00+00:00",
      "end_date": "2024-10-25T01:30:00+00:00"
    },
    {
      "title": "Philosophy Film Club screening: *The Conversation* (dir. Francis Ford Coppola)",
      "description": "Christoph Cox (Dean, Eugene Lang College) will facilitate our discussion of \"The Conversation,\" a taut psychological thriller played out in a paranoid climate of surveillance amid “an increasing awareness of the technology and techniques deployed by the state's secret services.” Ensnared in a web of intrigue, we are invited to ask: what if the greatest mystery isn’t what you hear, but what you’ve missed? Bubbly beverages and tasty snacks always provided.For more information or to be added to the mailing list, email: veronica@newschool.edu",
      "location": "63 5th Ave.,Room U105 (1st Floor)",
      "url": "https://event.newschool.edu/theconversationfilm",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "The New School For Social Research",
        "Eugene Lang College Of Liberal Arts"
      ],
      "tags": [
        "general public",
        "philosophy",
        "intellectual culture and big ideas",
        "eugene lang college of liberal arts",
        "the new school for social research",
        "screenings",
        "63 5th ave.,room u105 (1st floor)",
        "film and media screenings"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-25T22:00:00+00:00",
      "end_date": "2024-10-26T01:00:00+00:00"
    },
    {
      "title": "VLC Forum 2024: Correct* History Naeem Mohaiemen: Prisoners of \"Shothik Itihash\"  ",
      "description": "The phrase ‘correct history’ has many meanings, and one early, sardonic use can be found in Naeem Mohaiemen’s 2014 solo show and book Prisoners of Shothik Itihash (“Prisoners of Correct History”) (Kunsthalle Basel, curated by Adam Szymczyk, 2014). In the foreword to the book, Mohaiemen wrote about the power-pleasing mania for enforcing “shothik itihash” (correct history). This was an invitation to think about the corrosive state-enforced obedient and hagiographic history being churned out of universities and publishing houses. This is a history that insisted there is only one narrative at every bend of Bangladesh's journey since the partition of British India. For the VLC Forum 2024, Mohaiemen revisits this project in the presentAfterwards, continue celebrating with us as we host our annual VLC Forum 2024: Correct* History Community Dinner and Party - a free dinner for all.This event is part of the Vera List Center Forum 2024: Correct* History, please visit here for more information.",
      "location": false,
      "url": "https://event.newschool.edu/naeemmohaiemenprisonersofshoth",
      "source": "The New School",
      "university": "The New School",
      "department": [
        "Schools of Public Engagement"
      ],
      "tags": [
        "eisjweb",
        "online_events_cal",
        "slide_events",
        "general public",
        "staff",
        "students",
        "arts",
        "education and pedagogy",
        "humanity, society, social justice",
        "intellectual culture and big ideas",
        "schools of public engagement",
        "lectures and talks",
        "lectures and panel discussions",
        "art and design"
      ],
      "audience": [],
      "categories": [],
      "other_tags": [],
      "start_date": "2024-10-25T22:30:00+00:00",
      "end_date": "2024-10-26T00:00:00+00:00"
    }
  ]
}